import 'dart:convert';
/// fanhui : 1
/// vip : "vip"
/// deling : ["未得令",1,0,0,1,"均衡",2,5]
/// system : {"yhbh":null,"beizhu":"","name":"第七位","xmwx":"第(木)七(金)位(土)","sexx":"男","PPFS":"公历排盘","city":"北京 北京 东城区","ztys":"0","Z_QRQ":"2024年3月20日00时0分","JYRQ":"2029-06-09","GNF":"2024","SiLing":"乙","SiLingFangshi":"子平真诠","nylm":"伏潭之龙","KLFX":"XmY1BCsMgEEVPM7PpxqSajotZaDQXyAmkBJEWU5Iu0ttXpaVQmMX7n8efcH3yesMcGPwFzFjPS7AEdG7ggJwLrFIuhgJSzSjggYZe9LIGq8HK4gOOgRyDqRcOyp07iy3bAHNuGLaFrGw7MhK0oatpda19ZM5QtuH9eANr920o3cdaIH7crCYFOO7mxALvSzpSjjHymjE8Endv","XingZuo":"双鱼座","WuHou":"玄鸟至","Hou":"春分 初候","getXiu":"壁","getAnimal":"獝","getXiuLuck":"吉","getXiuSong":"壁星造作主增财，丝蚕大熟福滔天，奴婢自来人口进，开门放水出英贤，埋葬招财官品进，家中诸事乐陶然，婚姻吉利主贵子，早播名誉著祖鞭。","getZheng":"水","getYueXiang":"宵","SCWG":"天格:木(2) 人格:火(3) 地格:水(9) 总格:水(10) 外格:金(7)","shengxiao":"龙"}
/// BZ : {"Tg":"戊","Tz":"午","mg":"丙","mz":"寅","tg":"戊","tz":"午","Sg":"戊","Sz":"辰","ng":"甲","nz":"辰","yg":"丁","yz":"卯","rg":"癸","rz":"未","sg":"壬","sz":"子","Kg":"乙","Kz":"丑"}
/// gwgx : " "
/// FX : {"zncs":["冠带临官三子位，男女宫中细端详","冬月腊月正月勿订结婚","生殖器粗长而直。","建议取名:瑗渊 瑗五行:金 瑗珠、瑗敬、瑗雅、瑗如、瑗勤、瑗琪。 渊五行:金 意为深、深水。福寿兴家，理智充足，慈样有德，环境良好，安享富贵。"],"KWSC2":["红颜薄命，多见不得良缘","这是一个盛衰起浮很大、凡事必须独立自主的命运！大都在中年期间可以平步青云，大显良机；技术、研究方面多见才能，或见成就","为人温顺，做事消极，较缺乏主张，做事经常半途而废此命内心多见烦忧，个性有欠开朗；思绪虽然极欲表态开朗，但难免忧豫、怅惘之憾","双亲恩薄，六亲缘浅，比朋难助，早年多苦，结婚运差","有收藏之癖好，多见在家安禅之士；一生防水厄之灾，远离为吉","才智过人，谋略远大，却显有志难伸之憾！做事只要按步就班、步步为营，反而容易成功；若是谋略太多，反见一事无成","欠缺活动力，多忧苦，个性欠朗，易烦心，乏耐力，多见半途而废，多学而不专","双亲缘浅，早见背景离乡，备具艰辛居所不定，常见搬家，浪荡不定；大都中年后可见好转","最需开展交际，面带微笑","穷通宝鉴调候用神参考:乙木司令,专用庚金,辛金为次。","三命通会日时断:生于申酉月，命主贵显。生于戌亥月，是大富大贵之命。生于寅卯月，孤伶。生于辰巳月，命主凶恶。忌壬申月，身有残疾，命主不利；庚辰月，受凶刑破；乙丑月，柱失土气，命主凶死。","伤官坐正官，主凶，骂人成癖，万事止滞，权柄复失，夫妻离别，亦为凶象配置也。","偏财坐食神，大吉，则为遇食增福，生涯顺遂，多利多益，得父或妾之助而发达。为官运途中享通，经商营业，繁荣昌盛。","劫财坐比肩，不吉，家事婚事不顺，为兄弟亲友劳苦。若女命因丈夫品行不正而烦恼。","癸日主：其个性是逞强顽固，是努力家，有耐力，热情大方，聪颖机灵，但心地狭窄，容易小气。","食神心性：优点：智慧聪明，有才华，气质高雅，重精神和物质之均衡发展。为人温和，通情达理，不与人争，思想脱俗，对精神生活追求很有目标。感情强，爱好文艺歌舞，凡事能预先为长远打算。亦主有口福，善烹调。缺点：理想高远，易致超脱现实。耐性虽有，体力不足。喜幻想，不喜被拘束。思想清高，自负不凡，内心常觉空虚寂寞。喜吃零食，喜烹调，对饮食文化有一定见解，在外吃饭机会多。","前年五月受胎，惊蛰节后出生。性格纯良温婉，对人从无恶语相加，但嫌六亲少缘，父母兄弟姊妹乏其助力，初限艰苦，处处靠自力更生，循步渐进，可望百尺竿头，蒸蒸日上，中年过后，家运事业皆见兴隆，凡事不宜急躁，尤戒贪婪，贪则失误，为色情而害家庭，宜要谨慎得荣幸。晚运一般 ，真假各半之命。","十一生人，性格随和，善解人意，远迟开发，早年艰辛，中年衣食有余，独惜六亲不得其力，兄弟亦未得其助，晚年能享天伦之乐，乃中平之命也。","子时生人，玉扇星，财库入命，为人性格刚强，孤独自负，有勇欠谋，是非多端，小事不拘，父母得力，夫妇相克，初年好学上进，中运奔波，晚运富贵，乃公卿之命也，运到好如春，叶绿花更红。*适业：军人、政法、经济、建筑、电气等，金水事业佳，忌土类。*吉凶年：十一、十八、三十六、四十九、五十八、八十四岁。"],"gz":"四两","cgg":"平生衣禄是绵长，件件心中自主张，前面风霜多受过，后来必定享安康","cggj":"晚年有福","cgjs":"命主出生在大富大贵之家，不仅衣食富裕、身体健康，加上自己独立自主性很强，因此财运事业都不错。就算遇到再大的困难，只要凭借自己的意志力克服，狂风暴雨之后必定是海阔天空。","qiongtongbaojian":"二月癸水，不刚不柔，但因乙木司令，泄弱无神，专用庚金为妙，辛金佐之。癸水至二月死地，休囚之极，加以乙木司令，泄弱元神，故专用庚辛破木而发水源，庚辛并用者，恐乙庚相合，更佐之以辛也。庚辛俱透，无丁出干者，科甲富贵，无庚辛贫贱常人，或庚透辛藏，异途位高，辛透庚藏，生员禀贡，庚辛两藏，富中取贵，异途显达，刀笔名高。二月癸水，水木伤官为体，木神当旺，不能不佩印，无庚用辛，不必拘执，二月阳气舒伸，无形中自有丙丁，故不必明见丙丁，亦可取贵也。或庚辛太多，得己丁两透，作大贵论。此言体用之变，庚辛太多，癸水弱变为强，月令乙木被克无力，取财官相生为用，作大贵推，乙藏己透，偏官无伤，庚辛金多，不能无丁制之，癸水至弱，柱无壬劫出干，不能用戊土，故取丁己也。或支成木局，时月又有木出干，此泄水太过，穷困多灾，即运入西方，亦不甚清泰，无用之人。支成木局，不见庚辛，为顺局从儿，一女造，甲寅，丁卯，癸卯，乙卯，诰封一品，但为人怯懦无能，运入西方逝世，女造柔懦尚无害，若为男造，不免贫困多灾矣。甲申，丁卯，癸亥，癸亥。贡士，大富，盖用庚得禄地，有在才略，且多肖子。按此造癸水通根申亥，反弱为强，惜无己土，用食伤生财，故富，支见申庚，旺木有制，故用丁火，非用庚也。丙辰，辛卯，癸酉，癸亥。用辛金，飞天禄马格，尚书。丁未，癸卯，癸亥，癸丑。飞天禄马格，拜相。飞天禄马格，以亥冲巳，酉丑合住巳字为要点，两造皆似是而非，特飞天禄马，本有伤官变格，谓为成格，亦无不可，总之木多水泄，不能无金，两造皆以辛金为用也。丁亥，癸卯，癸卯，癸丑。用丑中辛金，又丁火出干，侍郎。按与丁未造，大致相同。庚寅，己卯，癸亥，庚申。专用庚金，故佐君泽民，神钦鬼服。按此造喜寅中暗藏丙火，用庚金，有阴阳和谐之妙，胎元庚午，以丁己财官为用也。庚子，己卯，癸卯，辛酉。庚辛两透，位至阁老。按庚辛并见，而无丙丁，虽科甲正途，终嫌阴柔奸险，此明代严嵩命造也，支备子卯酉，加胎元庚午，成格而备四极，故其奸险之祸，亦加於四海，午宫己土得禄，财官相生为用，格虽大贵，究不足取。癸卯，乙卯，癸卯，己未。乙木重重，有克己之势，无克己之力，盖因未内藏丁，泄乙而生己也，故名列宫墙。癸卯，乙卯，癸巳，甲寅。宜用庚金，因巳中丙制庚，破去用神，故一生劳碌，不能处世。按以上两造，皆缘木旺无金，癸水元神泄弱，不足以任财官也。以上造化元钥。丁酉，癸卯，癸卯，辛酉。此为明穆宗隆庆命，有印比生助，帝皇之位，专恃荫庇，胎元甲午，食神生财为用，运行西北，毫无作为，一生享荫庇福而已。辛巳，辛卯，癸丑，乙卯。光绪七年二月廿一日卯时。章士钊命：丑宫己辛，煞印相生，辛透丙藏，位至教育总长。戊子，乙卯，癸未，庚申。光绪十四年二月初一日申时。石某命：时逢庚申，癸水反弱为旺，月令乙卯，见庚输情相合，专用未中丁火，破庚金印，生己土煞，戊土虚浮，又为旺木所伤，用煞不用官，故为武贵年时遥合，自幼游历欧美十七邦，归国授军少将。","ditiansui":"癸水至弱，达于天津。得龙而运，功化斯神。不愁火土，不论庚辛。合戊见火，化象斯真。原注：癸水乃阴之纯而至弱，故扶桑有弱水也。达于天津，随天而运，得龙以成云雨，乃能润泽万物，功化斯神。凡柱中有甲乙寅卯，皆能运水气，生木制火，润土养金，定为贵格，火土虽多不畏。至于庚金，则不赖蜞生，亦不忌其多。惟合戊土化火也，戊生寅，癸生卯，皆属东方，故能生火。此固一说也，不知地不满东南，戊土之极处，即癸水之尽处，乃太阳起方也，故化火。凡戊癸得丙丁透者，不论衰旺，秋冬皆能化火，最为真也。任氏曰：癸水非雨露之谓，乃纯阴之水。发源虽长，其性极弱，其势最静，能润土养金，发育万物，得龙而运，变化不测。所谓逢龙即化，龙即辰也，非真龙而能变化也。得辰而化者，化辰之原神发露也，凡十干逢辰位，必干透化神，此一定不易之理也。不愁火土者，至弱之性，见火土多即从化矣；不论庚辛者，弱水不能泄金气，所谓金多反浊，癸水是也。合戊见火者，阴极则阳生，戊土燥厚，柱中得丙火透露，引出化神，乃为真也。若秋冬金水旺地，纵使支遇辰龙，干透丙丁，亦难从化，宜细详之。","sanmingtonghui1":"六癸日生时壬子，青云得路最为奇；若无己土冲克破，自有功名显达时。癸日壬子时，日禄归时，癸水子上建禄，若年月干支无戊己午未字刑冲破害，三元有倚托，通月气者，文章秀丽，官职显达；若通木气月，亦贵。如柱透己，有甲合，亦贵。否则，反覆。癸未日壬子时，申酉月，贵。戌亥，大富贵。寅卯，孤。辰巳，凶。忌壬申月，身不全，凶；庚辰月，凶刑；乙丑月，失土凶死。日禄归时局中得，食神喜遇怕刑冲；伤官莫道伤财运，官不加兮财不丰。癸日时临壬子，名为归禄格同，家门白屋也峥嵘，玄武当权禄重。水清宝瓶益盛，文章博览多通，荣迁来历紫薇封，甲午寅亥破动。","sanmingtonghui2":"癸水属阴，乃大海无涯之水，不能生长万物。一云雨露润泽之水，滋助万物。喜春秋间，运行巳午戌地，发福非常。大忌辰戌丑未运，成败。地支亥卯未合，伤旺益财。无寅甲，亦发名利，如见己土丑未月，更带三刑，平常衣禄，初中未济，终末荣发。若五行有救，身旺，运喜财官，亦主贵显。壬癸日生水为主，根基惟在火与土。春秋来往发财官，冬夏东行为得所。壬癸日生，坐下辰戌丑未巳午，为玄武当权。运行宜火木分野，过与不及，偏阴偏阳，则贵而不实。若生四季巳午月，引亥子时；或冬生，引辰戌丑未巳午时，俱贵。非此时，虚名虚利。运喜金水分野，生助为荣。无金则水绝。忌比肩劫财。冬十一月三合结局，水涨横泛而土崩。故水无土则滥，土无水则干。土得水而受润通气，水得土而成堤为河，二者不可偏倚。若更气运得宜，无不贵显。其刑合、拱合等格不在此论。六癸日用丙丁为财，戊正官，己偏官。若四柱透丙丁戊字，生九夏四季火土局，财官有用，若无此三字，生九夏四季火土局中，亦作财官论。见壬癸夺财，甲伤官，不利。若生春冬水木局中，财官无气。喜行南方四季财官之运。怕官煞混杂，有煞无制，鬼论；制太过，凶。更详日干于月令内有无力助，轻重言之。运喜忌同上。","sanmingtonghui3":" ","sanmingtonghui4":"春月之水，孰不谓其病寅死卯墓辰为至弱矣，殊不知水为阴气，生申旺子。秋冬之时，其气翕聚未散，故水常涸，春至，阳气上蒸，阴气下降，故雨露既濡而水生发，此水势之常耳。星家以活水生于卯者，良有以也。晴则春水溶溶，雨则汪洋泛滥。二、三月之水，浩无边际，见土则有堤防，昼则富贵，夜则流移，生于谷雨后者，或主淫邪痹惫之疾，盖土浑水浊故也。见火则水火相刑，灾讼不免。遇金生水，泛滥无情，徐、扬人干支得土者，无咎。见木泄之，能施惠及人。兖、青人生于二月中旬者，木气正旺，盗其元神，则生风怯之疾。得金助之，无患。","bazitiyao1":"癸水生来卯月中，无官无杀喜和同。顺行南地多清贵，恐入西方寿早终。","bazitiyao2":"癸水诗曰癸水应为雨露麽，根通亥子即江河。柱无坤坎还身弱，局有财官不尚多。申子辰全成上路，午寅戌备要中和。假饶火土生深夏，西北行程岂太过。","bazitiyao3":"卯宫诗曰卯木繁华气禀深，仲春难道不嫌金。庚辛叠见愁申酉，亥子重来忌癸壬。祸见六冲应落叶，喜逢三合便成林。若归时日秋金重，更向西行患不禁。","shenfengtongkao1":"古诗:临未则略应返朴。今译:火之余气，小有成就。","shenfengtongkao2":"古诗:生逢坎位带禄兮，四海名张。今译:水主智，晚年有才名。","shenfengtongkao3":"古诗:职禄俱全，官封印旺。今译:不取财，癸水之官是戊，癸水之印是庚，戊旺在巳午，庚申酉。古诗:少年败散，鬼病财微。今译:财微，水克火为财，火败在亥子，即是年上比劫坐禄。古诗:祖上名高，岁居有气。今译:年上财官有根。古诗:年中困塞，为失其时。今译:年柱地支财官坐绝。古诗:自坐衰乡有克者，脚膝之病。今译:日主无根，又见官杀旺，主有疾。古诗:自身健旺遇水兮，妻必先亏。今译:比劫会局又透壬癸，克妻。古诗:四水朝元有气也，身居八位。今译:四柱皆水成全水局，从旺，吉命。古诗:三元羸弱，支克而官职则卑。今译:月日时，日主无根，又见冲刑，则没有官禄之分。古诗:至老鳏居水盛也，火生绝处。今译:会水局夏生，透壬癸，难有佳妻。古诗:三妻二妾干杂兮，火旺金实。今译:天干丙丁财杂透，地支又见巳午未，主有女人缘。古诗:暗损多逢无救也，必应绝嗣。今译:地支多冲无和，子息迟。古诗:终身不遂，遇衰乡，迢迢东西。今译:日主无根者东奔西走。古诗:财到旺乡，重见兮，父母有失。今译:癸水财旺，是巳午未，火必克印（母）。古诗:鬼居本位，叠遇兮，流落身衰。今译:鬼，七杀，癸以己为七杀，天干两己，地支丑未多，难有安定之生涯。杀重身轻。古诗:长生土乡，无化也，难图厚利。今译:生于辰戌丑未月，天干戊癸合见和而不化，也无大利。古诗:生逢水旺，纵亏兮，亦有衣食。今译:水旺比劫多，虽然破财，也不会没有基本生涯。比劫破财不至于没有衣食。","tianwuwuxian":"书谓五阴生处不为生，卽癸水生于卯月，卯为癸之长生，实际卯乃纯粹之木，有泄无生也，时逢壬水刼财，子水日禄，得声应气求之助，癸水弱而转强，不愁泄气，若甲乙透干，无金破木，无土尅水，伤食当旺，日主亦强，便是一清到底，大贵之命。","wuxingjingji1":"甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，若见戊辰戊戌木生之为贵格，忌壬辰壬戌丙午丁未水最毒。","wuxingjingji2":"癸未自库之木，生旺尤佳，虽乙丑金不能冲破，各归其根，而不相犯，忌庚戌乙未金。","wuxingjingji3":"【源远流清】水人见木为本利，得火相逢凶害至，更无火木见金神，决主少年登显秩。金为水本源，木得水滋，深为利用，见木却生火，火旺则反伤于金，五行中若无木火，但得金气发露，则生出水禄自然。【无救成凶】水人切忌戊申寅，截断根源主祸频，局内不逢金发露，平生波劫受艰辛。戊申戊寅乃土成实之地，水人生处受制，病处见鬼，故曰，截断根源，五行中若见魁罡，则鬼气无以化藏，水神如此，可谓困矣。【长鬼为殃】水人大怕火炎扬，寅午相逢转更忙，若见丙加辰戌位，定知夭折见悲伤。寅午乃火生旺之地，火炽可知，水神如此则竭矣，五行若见魁罡，如丙戌之类，水神之福转衰矣。（并太乙统记）","wuxingjingji4":"论水四时皆忌火多，火多则受竭，忌见冲刑，冲刑则横流，忌见土重，土重则不流，忌见金死，金死则水囚，忌木旺，木旺则水死。又云天倾西北，水之源，地陷东南，水之府。天倾西北，亥为水出之方，地陷东南，辰为纳水之海，逆流到申而作声，故水不西行，水多则溢，反散漫而多不足也，土年亦然，卯巳同。玉霄宝鉴云：水之性润下，逆则有声，顺则有容，年月日时，逆行十二辰者逆也，入格者主清贵有声誉，顺行十二辰者顺也，主有度量，有吉神扶助乃贵格。悟玄子云：水流清处遇冬天，壬癸难逢亥子全，最爱金生名秀气，偏惟败土浊根源一本云：偏为败土浊其源。李九万云：水不绝源，亦伏金而流远，水不可太过，过则反伤。沉芝云：水命动摇多主浊，注云：凡水命不要太旺，更逢冲破，主常俗之人，或阴人不爱旺，多主淫荡，爱自主自绝则吉。","wuxingjingji5":" ","wuxingjingji6":"惊蛰二月节春分二月中二月坤为天德，甲为月德，己为月合，庚为月空，甲乙丙丁为月中秀气，支宜寅午戌亥卯未，畏见壬辛二干，申酉二位，损时之德。二月秀在甲乙亥卯未，及纳音木。丙丁寅午戌，及纳音火。二月卯木正旺，若逢申金，木绝其气，酉又破卯，有此者，不惟无贵，尤破祖业，多为贫下之人。凡禀月中秀气，却有损坏时日者，最紧切，盖日为引，时为用也。又须看中气，如中气后五日，即使将来者进，功成者退，此说十二月中气极要审详之。二月甲寅、甲辰、己亥、己卯、乙亥、乙卯、乙未，俱为秀气，宜审酌用之（广信集）。遇甲乙居寅辰未亥之上尤美也。如己在亥卯未上，亦为秀气，何也？如妻在夫家，随夫之姓也。若遇辛酉癸酉为破家之厄，缘金木之气，忌全金冲克，若时日遇之，遭刑不贱，纵有其德，终身不立，若遇丙丁，为和气通明之时，在木为花，轻盈而容，不能久也。如丙寅日、辛卯时，此从木之性，其气实而华，必为明达身容之士。如甲午日、丁卯时，此木弱火虚，遇时而不通，乃伎术工巧近贵之人，福不能久也。若遇壬癸冲注其木，兆能生养，常有不安，二月之候，死水浸活木故也。遇之安闲渐亨，不及富贵之地，若更其中藏土，必为疾厄之人，如水在甲申之纳音，壬辰之干，犹有位之人也。二月己酉日癸酉时，此水土俱遇死败之上，乃水土浑浊，如癸酉之金，损时之德，不惟下贱，更多残疾也。壬辰之水秀气不浊，甲申之水，隐金木交会，藏于阴而寄于甲，故不得为死水推之，遇此之时，巧拙须详引用言其轻重也。（神白经）","lixuzhongmingshu1":"甲辰禄马承，乃始壮之火，欲多生我，或会本源却无炎光之极，自然超卓，水轻而无土，亦可腾达矣。甲丙生寅，明我生气。","lixuzhongmingshu2":"癸未禄自备，为伐根之木，气败而体柔，不嫌金制，喜水之荣，及会元而借生主，乃重器成德之材。癸在巳中，喜逢甲乙。","xiyongshencankao1":"二月癸水，不刚不柔，乙木司令，泄弱元神，专用庚金为用，辛金次之，庚辛俱透，无丁出干者，贵由科甲，无庚辛者常人。或庚透辛藏，荣封有准，庚藏辛透，亦有衣衿，庚辛两藏，富中取贵，或刀笔扬名，或庚辛重见，有己丁出干者亦贵。或支成木局，月时又见木者，为泄水太过，定主贫困多灾，即运入西方，亦属无用。","xiyongshencankao2":"二月的癸水,不刚也不柔,乙木执掌时令,泄弱了日元,专以庚金为用神,辛金为其次。庚辛二金都透出,无丁火出现在天干的,贵显出自科甲;无庚辛金的,为常人。或者庚透出而辛伏藏,荣显受封是一定的;庚伏藏而辛透出,也可以成为秀才;庚和辛两者都伏藏,主从富中取贵,或者凭刀笔扬名;或者庚和辛重叠出现,有己土和丁火出现在天干的,也主贵显。或者地支会成木局,月柱时柱又出现木的,属于泄水太过,一定主贫困而多灾难,即使行运进入西方,也没有用处。","rizhufenxi":{"日干心性":"逞强顽固,是努力家,有耐力,热情大方,聪颖机灵,但心地狭窄,容易小气。","日干支层次":"[癸未][中等]坐下有食神生财、财生杀，因坐偏财、七杀，故男女命逢癸未，重婚较多，但男女均漂亮，爱情专一。","日干支分析":"心急口快，为人伶俐；救人无恩，反招是非，曲直难辩，多有误会。有财无库，过眼烟云，财来财去，精打细算，可免祸灾；女人贤惠，勤俭持家；晚景平安。","性格分析":"癸有测量之意,水之阻的癸是指隆冬之时,草木枯萎一望无际,因而便于测量。有别于壬的大河性格,癸是指小溪,水沟的细细水流、池沼混浊的水,或在草木叶上栖息的露水。壬可以说是表现之水,而癸则是底层的深水,水的表面尽管明亮,但光线却很难射入水底,因此癸的人在内心深处始终稳藏了神秘的性格。癸日生的人性情平等、顺从,重视默默的努力,但是当努力不为人接受时,忍耐到极点后会爆发怒气。由于善于察言观色,并加以协调配合,因而有旺盛的服务精神。癸未日生的人初看粗枝大叶,事实上头脑极慎密,本人对此也有十分的自信,有玩弄权谋术数的倾向。","爱情分析":"你的命局中日干支相战，意味着你结婚后容易遇到一些不顺和挫折，在婚姻中有较多矛盾和痛苦。选择晚婚反而对你比较有利。由于日支主气十神为七杀，所以你未来的另一半身高方面表现的会比较优越，另一半是骨架较大、体型挺拔的类型。加上你的日支在辰，对方的长相较一般，气质稳重朴实。为人具备亲和力，心情开朗，让人想要接近，对感情充满浪漫的想象。男命相貌堂堂，女命面貌清秀，生活中容易有喜事发生。另一半家境较好，在感情中女方付出较多。一旦经济状况走低，二人则容易为财务问题而争吵不和。在感情中，您有独断独行的性格，喜欢有点刺激和浪漫的感情模式，主观意识比较强，性格有点顽固，在感情中您有保留个人威严的习惯，需要伴侣时刻绝对的尊重甚至追崇。而感情讲求两个人的融合，在感情中您与另一半的相处有较多碰撞，自己不愿意为另一半而改变或做出妥协，争吵较多，影响对感情的培养。因此，即便您的异性缘不错，但一旦进入关系，感情就容易不顺，需要及时调整自己的性格。","事业分析":"癸意味着地下水，因此他不会在人们看到的地方活动，而是在某个深处朴实工作，有许多保守的研究者是癸日出生的，他们不是爱女学生欢迎的王牌学者，而是朴实的累积成果。由于洞察力非常敏锐，很适合参谋工作，在团体中如果立他为副领袖，可以发挥智慧推展许多活动。在公司或组织中，癸型的人都擅长订定计划，并会完美的达成任务，加上他十分擅长于预先准备好各方面有利的话而圆满达成交涉，因此多活跃于幕后，成为所谓的谋士。水的流通也意味钱的流通，五行中土是不动产，而金则为动产。依此看来，癸很适合往金融业发展。此外，若论流通，人来人往的百货公司、超级市场、交通业、旅游业等也非常合适。癸的人特别擅长对人服务，因而介绍人、顾问、贩卖报纸等以服务为主体的行业全部都很适应。特别是甲年生的人最能发挥癸的服务性，饭店业、理容业也是这型人的得意业。服务业中凡是利用水性的行业如咖啡厅、酒吧点心店、餐厅、小吃店等都没问题。清凉饮料、牛奶、酒类业更是没话说的适合。此外，需要大量水的温泉、浴场、洗衣店等也是癸可选择的行业。水也可广义的解释成液体，因此也可考虑石油、汽油贩卖等相关职种。","财运分析":"癸也属水性，有很好的洞察力。这种类型的人多勤勉努力，不靠洞察力或先见力。也能够聚集努力的结晶，拥有钱财或不动产。赚得快花得快是人之常情，但这种类型的人却例外，钱财一旦到手，就会慎重、踏实的处理。例如在公司举办的“意见竞赛”中夺魁而得到的奖金，癸的人会把它存起来当成结婚资金，决不会把它用在吃喝上。想来这种类型的人深知“聚沙成塔”的各种滋味，知道钱的好处多多。除了正式的工作外，他们多半也尝试各种打工增加副收入。","健康分析":"癸位居十干之末，从健康运来看，已呈疲劳的状态。不过，他同时又孕育十干之首的甲，所以内含精力。尽管外观虚弱，但仍有十分强的健康运。癸中要属己年和乙年生的人最须留意，不要太过勉强自己，一旦觉得疲劳，应立刻休息。概括来说，癸的人较容易惟患肾脏系统的疾病。面呈黑色的人更须特别注意。"},"XingZuo":{"角色":"多愁善感的幻想家","月份":"2.19-3.20","特点":"浪漫梦幻","象":"水象","掌管宫位":"第十二宫","最大特征":"滥情","主管星":"海王星","性格特征":"神经质、健忘、多愁善感、想像丰富、自欺欺人等等都是双鱼座的形像词，不过双鱼座最大的优点是他有一颗善良的心，他最喜欢帮助人，愿意牺牲自己而为别人。\\n双鱼男\\n温柔多情的双鱼座男生，就是一典型的风流才子范。双鱼男充满了浪漫唯美的色彩，在你们的世界里拥有着对爱情美好得如童话般的追求。之于生活，双鱼男却知足常乐，只要得过且过即可。看似文弱不堪一击的双鱼男，面对困难险阻时却能迸发出惊人的不服输精神。只是在抉择面前，却又显得特别黔驴技穷。","优点":"不自私、善解人意\\n具有想象力、浪漫\\n感情丰富、温和有礼\\n心地仁慈、舍己为人\\n直觉力强、懂得包容\\n容易信赖别人、不多疑\\n仁慈、天真、富有同情心。","缺点":"容易受环境影响\\n粗心、浮躁、散漫\\n不切实际，幻想太多\\n缺乏理性，感情用事\\n没有足够的危机意识\\n缺乏面对现实的勇气\\n缺乏自信而意志薄弱\\n多愁善感、意志不坚定\\n优柔寡断、不善于理财\\n很容易养成说谎的习惯\\n容易陷入沮丧而不可自拔"},"YRJPFX":"(1)癸水日、卯月生者，水性不会太柔，亦不会太刚。卯之中，有乙木司令，生日之气泄出，我身变弱，故应专用庚金，辛金次之。庆、辛透出．且无丁字时，功名有望。\n(2))命中无庚、辛，且日干弱时．为“画饼充饥”之命。即无庚辛作为癸水之水源时，必为贱命。\n(3)有庚、辛两者之一．不论为明或睹，均可得名利，惟其力较差。与磨玉增光之理相同，需努力方得成功。\n(4)庚、辛俱藏时．为先富而后贵之命。可以笔墨而扬\n(5)地支成亥卯未之三合木届时，月时再逢木气，则漏气太过，定为贫命，灾厄多。举左女命一例示之：\n生年 甲 寅\n生月 丁 卯\n生日 癸 卯\n生时 乙 卯\n以上之命，为“从儿格”，为人柔懦无能，但亦为一精秀好命。逢西方之金运时，旺神被破，则身死。如此称为“旺神发怒”。","GDLM":["六宫","和尚之命","【诗曰】衣禄僧道门中依，看破红尘最相宜，姻缘好似花间露，三次应娶两次离。","【婚姻】论到婚姻，终身无缘，虽然迟娶，命中亦有刑克，而且内助不立。无妻若能强硬配合，最好两地相离，各息谋生，方可免去灾星。","【财运】正财平平，偏财有限，初运交进，无非依人为活，作事劳而无功。碌碌奔波过度，中运暮境，亦是百事难成。老能主张分明，有点恒心，足以自立基业。","【子息】命里孤单前定，虽然生有子，到头无一认亲，不但难延嗣续，而且徒增悲哭，若能广积阴德，善种心田，或可贻留后福，延接嗣续。","【禄位】诗书无缘，功名莫求，出门离祖，尚属相宜。东南两方，任君奔走，经商方可，但终不能博取大利，而且大权难得，无非替人做事，衣禄奔求，寿元花甲。"],"SCWG":["简介：虽有一时的顺调发展基础不安定恐遭意外的灾祸有急变、急死、多风险的配置。【凶】","1、总论:配置不良或许能有一时的成功恐有意外变化好景不常应谨慎意外灾祸之发生更应修身养性来保住您的生命或财产。天运五行有助可成功立业。","2、性格:喜占上风容易得罪人凡事好争好斗易发生无谓的纠纷凡事忍让点戒除不必要的虚荣心做事详加考虑脚踏实地可保身心愉快。有好色之嫌。","3、意志:意志不坚定易受酒色迷惑但耐性尚佳可忍受失败的痛苦或意外的打击。","4、事业:费心尽力为家庭劳累如有一时的成就宜退守为安。","5、家庭:夫妻感情不睦应多忍耐免得姓名测试爱情破裂。","6、姓名测试爱情:男娶个性刚强之妻常有争吵难得幸福;女嫁有家庭责任感之夫但姓名测试爱情不美满。","7、子女:个性孤癖身体较虚弱。","8、社交:虽能言善道但性情急躁容易得罪人好面子不愿屈居人下恐有纠纷发生。","9、精神:有后顾之忧心神难得安宁。","10、财运:时好时坏财源不稳如能慎重行事老运财源可得。必须减少浪费之事。","11、健康:注意外伤腰酸脚痛心肌或血管硬化。女人有妇科病或难产。","12、老运:老境孤独较为操心但财源不缺。","健康运：严重地不安定有意外的灾难可导致财产、生命的损失。【凶】","成功运：受上级长辈的照顾关心能顺利成功发达。【吉】","人际关系：虚荣心强快热快冷无感情倾向多受外部刺激易浪费易外伤。数佳者可安全。【平】","性格：性急进。血气旺溢手腕灵敏富活动力。名利心甚重智谋才略具备感情锐猛有如燃火之气魄。但也有气狭者。大都富有成功运盛名一时。但也可能中途多生出支节。"],"liangtoqian":"解卦，芳草逢春格\n春来芳草依依绿，雪散纷纷见枯竹，空中群雁各东西，伤情独向滩边宿。雨里桃花风里烛，平生到此心未足，树头花发两三枝，一朵枝头红似玉。陆地行舟水未来，空将心事委尘埃，逢牛渐渐登云阁，跨马骑牛大路开。\n金鸾，天印，科名\n此星照命，乃福禄之星。科名之宿，如珠之命。自立规矩，自辟门庭。比如大海之舟，又似水中萍梗。有三般早：当家早，忧虑早，历事早；有三般迟：发禄迟，妻子迟，享福迟。只得命中有退神重重，若要名成\n（解）\n天鸾星\n壬子春草下塘（解）枉费心思，毫无意处。\n壬寅寒潭下钓（解）作事劳苦，所得甚微。\n天印星\n壬辰旱苗逢雨（解）虽则穷困，转机即在目前。\n壬午虫叶初黄（解）办事有实力，能兴家立业。\n名利星\n壬申华筵点灯（解）处境优游，名利兼收。\n壬戌月照寒潭（解）清闲自在，衣食不愁。\n判断\n此命乃名利之曜，福禄之星，自成规矩，自创门庭，风中败叶，水上浮萍，三迟三早之命，当家早，劳心早，忧虑早，发禄迟，妻子迟，享福迟，命中有救神，不犯官刑，凶事不成凶，好处不见好，若要事十全，直待寿年老。芳草逢春格\n春来芳草依然绿，雪里园花见枯木，亲生兄弟有如无，只为生业命孤独，雨里桃花风里烛，碌碌里无为是足，枝头花发两三枝，只许一枝红又绿。\n事业独撑持，成中有石皮，龙羊犬牛会，黄菊满东篱。\n基业\n陆地行舟去必难，空劳心事把门关，牵牛跨马登途远，雪路迢迢隔两山。\n兄弟\n空中群雁各东西，一个孤雁独自飞翔，明月清风多少兴，声声牧笛劝人归。\n行藏\n雨里天桃风里烛，平生到处心不足，桑榆茂处好归耕，野渡横舟莺出谷。\n婚姻\n一地鸳鸯水小浮，蒿居鸯懒困何休，的大欧鹭纷纷去，飞向白萍红蓼洲。\n子女\n花发树茂两三枝，双双伴叶销金玉，龙楼凤阁往来人，引多领群仙有清福。\n收成\n若遇牛羊方始闲，好骑牛背上青山，逍遥路上花如锦，月照梅花影过闲。","gewuzhiyan":"癸未：洲泽湾曲之水也。\n坐於未库流为湾曲之象，人多假道学。\n心事有外清内蒙之象。\n最喜金水透出天干，亥卯会入地支。\n以成利达之美。\n若火土重逢多是遇而不遇。\n喜行金水木，忌火土库。\n\n<日元确论>\n癸未：此川泽曲湾之水也。\n癸坐未库。\n流月有湾曲。\n人领之，有智谋，有机变，最喜金水透出天干。\n亥卯会入地支以成利达之美。\n若火土重逢，多是遇而不遇。\n喜行金水木，忌行火土库。\n\n<生成造化>\n癸未为川泽湾曲之水。\n癸坐未库。\n流有湾曲。\n人领之有智谋，多权变。\n最喜金木透干，亥卯会枝，以成利达。\n若火土重逢遇而不遇。"}
/// chusheng : {"gongli":"2024年3月20日0时0分","nongli":"二〇二四年二月十一子时","DL1":"惊蛰","CL1":"清明","DL2":"2024-03-05 10: 22: 43","CL2":"2024-04-04 15: 02: 15","QY":"5年2个月20天","HYWS":"9","WXWS":"木旺 火相 水休 金囚 土死","QH":{"冬至":"2023-12-22 11: 27: 20","小寒":"2024-01-06 04: 49: 20","大寒":"2024-01-20 22: 07: 20","立春":"2024-02-04 16: 27: 05","雨水":"2024-02-19 12: 13: 10","惊蛰":"2024-03-05 10: 22: 43","春分":"2024-03-20 11: 06: 23","清明":"2024-04-04 15: 02: 15","谷雨":"2024-04-19 21: 59: 44","立夏":"2024-05-05 08: 10: 03","小满":"2024-05-20 20: 59: 29","芒种":"2024-06-05 12: 09: 52","夏至":"2024-06-21 04: 50: 58","小暑":"2024-07-06 22: 20: 01","大暑":"2024-07-22 15: 44: 24","立秋":"2024-08-07 08: 09: 13","处暑":"2024-08-22 22: 55: 01","白露":"2024-09-07 11: 11: 18","秋分":"2024-09-22 20: 43: 39","寒露":"2024-10-08 02: 59: 55","霜降":"2024-10-23 06: 14: 45","立冬":"2024-11-07 06: 20: 02","小雪":"2024-11-22 03: 56: 29","大雪":"2024-12-06 23: 17: 00"}}
/// DZSS : {"甲":{"全":"伤官","半":"⁢伤"},"乙":{"全":"食神","半":"⁢食"},"丙":{"全":"正财","半":"⁢财"},"丁":{"全":"偏财","半":"⁢才"},"戊":{"全":"正官","半":"⁢官"},"己":{"全":"七杀","半":"⁢杀"},"庚":{"全":"正印","半":"⁢印"},"辛":{"全":"偏印","半":"⁢枭"},"壬":{"全":"劫财","半":"⁢劫"},"癸":{"全":"比肩","半":"⁢比"},"寅":{"本":{"全":"伤官","半":"⁢伤"},"中":{"全":"正财","半":"⁢财"},"余":{"全":"正官","半":"⁢官"}},"卯":{"本":{"全":"食神","半":"⁢食"},"中":{"全":null,"半":"⁢"},"余":{"全":null,"半":"⁢"}},"辰":{"本":{"全":"正官","半":"⁢官"},"中":{"全":"食神","半":"⁢食"},"余":{"全":"比肩","半":"⁢比"}},"巳":{"本":{"全":"正财","半":"⁢财"},"中":{"全":"正官","半":"⁢官"},"余":{"全":"正印","半":"⁢印"}},"午":{"本":{"全":"偏财","半":"⁢才"},"中":{"全":"七杀","半":"⁢杀"},"余":{"全":null,"半":"⁢"}},"未":{"本":{"全":"七杀","半":"⁢杀"},"中":{"全":"偏财","半":"⁢才"},"余":{"全":"食神","半":"⁢食"}},"申":{"本":{"全":"正印","半":"⁢印"},"中":{"全":"劫财","半":"⁢劫"},"余":{"全":"正官","半":"⁢官"}},"酉":{"本":{"全":"偏印","半":"⁢枭"},"中":{"全":null,"半":"⁢"},"余":{"全":null,"半":"⁢"}},"戌":{"本":{"全":"正官","半":"⁢官"},"中":{"全":"偏印","半":"⁢枭"},"余":{"全":"偏财","半":"⁢才"}},"亥":{"本":{"全":"劫财","半":"⁢劫"},"中":{"全":"伤官","半":"⁢伤"},"余":{"全":null,"半":"⁢"}},"子":{"本":{"全":"比肩","半":"⁢比"},"中":{"全":null,"半":"⁢"},"余":{"全":null,"半":"⁢"}},"丑":{"本":{"全":"七杀","半":"⁢杀"},"中":{"全":"偏印","半":"⁢枭"},"余":{"全":"比肩","半":"⁢比"}}}
/// ZGss : {"Sbq":"戊","Szq":"乙","Syq":"癸","mbq":"甲","mzq":"丙","myq":"戊","tbq":"丁","tzq":"己","tyq":null,"nbq":"戊","nzq":"乙","nyq":"癸","ybq":"乙","yzq":null,"yyq":null,"rbq":"己","rzq":"丁","ryq":"乙","sbq":"癸","szq":null,"syq":null,"Tbq":"丁","Tzq":"己","Tyq":null,"Kbq":"己","Kzq":"辛","Kyq":"癸"}
/// bazixinxi : {"zh":[[0,2,3,1,2],[4,4],[50,50],[0,3,2,1,2],[1,7],[88,13],"未落空"],"ZaoShi":"湿","wanzishiliupai":"按明天","bazishengyue":"惊蛰之时，飞龙在天，利见大人，利路亨通，作事大与，有机可称，正是出头之时，德望成功，终成大业，竟天才成功之守，地位权位受人敬仰，有冲天之势，威镇山河。"}
/// JSFW : {"zg":"巽卦(东四命)","b":"生气","db":"绝命","d":"延年","dn":"伏位","n":"天医","xn":"五鬼","x":"六煞","xb":"祸害"}
/// LNDY : [2024,1,"小运",2029,6,"戊辰",2039,16,"己巳",2049,26,"庚午",2059,36,"辛未",2069,46,"壬申",2079,56,"癸酉",2089,66,"甲戌",2099,76,"乙亥",2109,86,"丙子"]
/// SS : {"NZSC":["华盖","月德贵人","金舆","天扫星","五鬼精神煞"],"YZSC":["将星","六厄","福星贵人","文昌贵人","天乙贵人","病符","埋儿煞","平头煞","悬梁关"],"RZSC":["华盖","太极贵人","天官贵人","天乙贵人","血刃","十灵日","勾煞","水溺煞","五鬼星","悬梁关","悬梁煞","华盖自墓"],"SZSC":["白虎兼刃","将星","披头煞","桃花","福星贵人","太极贵人","禄神","九丑日","童子","平头煞","五鬼关","原局桃花","急脚关","劫路"]}
/// LLSS : {"甲子":["月德贵人","将星","披头煞","桃花","福星贵人","太极贵人","禄神","劫路"],"乙丑":["寡宿","披麻","福星贵人","天乙贵人","破太岁","绞煞","水溺煞","裁锋煞","攀鞍","将军弓","枭金食木","劫路","暗金煞"],"丙寅":["吊客","驿马","天医","福星贵人","金舆","亡神","犯天狗","流霞","活曜","地狱","学堂","天耗","吞啖煞"],"丁卯":["将星","六厄","福星贵人","文昌贵人","天乙贵人","害太岁","病符","埋儿煞"],"戊辰":["华盖","金舆","值太岁","刑太岁"],"己巳":["天德合","劫煞","孤辰","天喜","驿马","太极贵人","天厨贵人","天乙贵人","统缢煞","破碎煞"],"庚午":["丧门","灾煞","天官贵人","浮沉杀","血支"],"辛未":["华盖","太极贵人","天官贵人","天乙贵人","血刃","勾煞","五鬼星","水溺煞","天刑煞","枭金食木"],"壬申":["劫煞","太极贵人","国印贵人","空亡","指背煞","官符"],"癸酉":["桃花","空亡","死符","枭金食木"],"甲戌":["月德贵人","国印贵人","红艳","冲太岁","独火","枭金食木"],"乙亥":["红鸾","亡神","元辰","阴注阳受","天厨贵人","羊刃","自缢煞","破率","裁锋煞"],"丙子":["将星","披头煞","桃花","福星贵人","太极贵人","禄神","劫路"],"丁丑":["寡宿","披麻","福星贵人","天乙贵人","破太岁","绞煞","水溺煞","攀鞍","将军弓","枭金食木","劫路","暗金煞"],"戊寅":["吊客","驿马","天医","福星贵人","金舆","亡神","犯天狗","流霞","活曜","地狱","学堂","天耗","吞啖煞"],"己卯":["将星","六厄","福星贵人","文昌贵人","天乙贵人","害太岁","病符","埋儿煞"],"庚辰":["华盖","金舆","值太岁","刑太岁"],"辛巳":["天德合","劫煞","孤辰","天喜","驿马","太极贵人","天厨贵人","天乙贵人","统缢煞","破碎煞","天刑煞","枭金食木"],"壬午":["丧门","灾煞","天官贵人","浮沉杀","血支"],"癸未":["华盖","太极贵人","天官贵人","天乙贵人","血刃","勾煞","五鬼星","水溺煞"],"甲申":["月德贵人","劫煞","太极贵人","国印贵人","空亡","指背煞","日运空亡","官符"],"乙酉":["桃花","空亡","死符","裁锋煞","枭金食木","日运空亡"],"丙戌":["国印贵人","红艳","冲太岁","独火","枭金食木"],"丁亥":["红鸾","亡神","元辰","阴注阳受","天厨贵人","羊刃","自缢煞","破率"],"戊子":["将星","披头煞","桃花","福星贵人","太极贵人","禄神","劫路"],"己丑":["寡宿","披麻","福星贵人","天乙贵人","破太岁","绞煞","水溺煞","攀鞍","墓杀","将军弓","枭金食木","劫路","暗金煞"],"庚寅":["吊客","驿马","天医","福星贵人","金舆","词馆","亡神","犯天狗","流霞","活曜","地狱","学堂","天耗","吞啖煞"],"辛卯":["将星","六厄","福星贵人","文昌贵人","天乙贵人","害太岁","病符","埋儿煞","天刑煞","枭金食木"],"壬辰":["华盖","金舆","值太岁","刑太岁"],"癸巳":["天德合","劫煞","孤辰","天喜","驿马","太极贵人","天厨贵人","天乙贵人","统缢煞","破碎煞"],"甲午":["月德贵人","丧门","灾煞","天官贵人","浮沉杀","血支"],"乙未":["华盖","太极贵人","天官贵人","天乙贵人","血刃","勾煞","五鬼星","水溺煞","裁锋煞"],"丙申":["劫煞","太极贵人","国印贵人","空亡","指背煞","官符"],"丁酉":["桃花","空亡","死符","枭金食木"],"戊戌":["国印贵人","红艳","冲太岁","独火","枭金食木"],"己亥":["红鸾","亡神","元辰","阴注阳受","天厨贵人","羊刃","自缢煞","破率"],"庚子":["将星","披头煞","桃花","福星贵人","太极贵人","禄神","劫路"],"辛丑":["寡宿","披麻","福星贵人","天乙贵人","破太岁","绞煞","水溺煞","攀鞍","天刑煞","将军弓","枭金食木","劫路","暗金煞"],"壬寅":["吊客","驿马","天医","福星贵人","金舆","亡神","犯天狗","流霞","活曜","地狱","学堂","天耗","吞啖煞","年运空亡"],"癸卯":["将星","六厄","福星贵人","文昌贵人","天乙贵人","害太岁","病符","埋儿煞","年运空亡"],"甲辰":["月德贵人","华盖","金舆","值太岁","刑太岁","真太岁"],"乙巳":["天德合","劫煞","孤辰","天喜","驿马","太极贵人","天厨贵人","天乙贵人","统缢煞","破碎煞","裁锋煞"],"丙午":["丧门","灾煞","天官贵人","浮沉杀","血支"],"丁未":["华盖","太极贵人","天官贵人","天乙贵人","血刃","勾煞","五鬼星","水溺煞"],"戊申":["劫煞","太极贵人","国印贵人","空亡","指背煞","官符"],"己酉":["桃花","空亡","死符","枭金食木"],"庚戌":["国印贵人","红艳","冲太岁","独火","枭金食木","月运空亡"],"辛亥":["红鸾","亡神","元辰","阴注阳受","天厨贵人","羊刃","自缢煞","破率","天刑煞","枭金食木","月运空亡"],"壬子":["白虎兼刃","将星","披头煞","桃花","福星贵人","太极贵人","禄神","劫路"],"癸丑":["寡宿","披麻","福星贵人","天乙贵人","破太岁","绞煞","水溺煞","攀鞍","将军弓","枭金食木","劫路","暗金煞"],"甲寅":["月德贵人","吊客","驿马","天医","福星贵人","金舆","亡神","犯天狗","流霞","活曜","地狱","学堂","天耗","吞啖煞","时运空亡"],"乙卯":["将星","六厄","福星贵人","文昌贵人","天乙贵人","害太岁","病符","埋儿煞","裁锋煞","时运空亡"],"丙辰":["华盖","金舆","值太岁","刑太岁"],"丁巳":["天德合","劫煞","孤辰","天喜","驿马","太极贵人","天厨贵人","天乙贵人","统缢煞","破碎煞"],"戊午":["丧门","灾煞","天官贵人","浮沉杀","血支"],"己未":["华盖","太极贵人","天官贵人","天乙贵人","血刃","勾煞","五鬼星","水溺煞","墓杀"],"庚申":["劫煞","太极贵人","国印贵人","空亡","指背煞","官符"],"辛酉":["桃花","空亡","死符","天刑煞","枭金食木"],"壬戌":["词馆","国印贵人","红艳","冲太岁","独火","枭金食木"],"癸亥":["红鸾","亡神","元辰","阴注阳受","天厨贵人","羊刃","自缢煞","破率"]}
/// DYWS : {"子":"临官","丑":"冠带","寅":"沐浴","卯":"长生","辰":"养","巳":"胎","午":"绝","未":"墓","申":"死","酉":"病","戌":"衰","亥":"帝旺"}
/// DYKW : {"甲子":"戌亥","乙丑":"戌亥","丙寅":"戌亥","丁卯":"戌亥","戊辰":"戌亥","己巳":"戌亥","庚午":"戌亥","辛未":"戌亥","壬申":"戌亥","癸酉":"戌亥","甲戌":"申酉","乙亥":"申酉","丙子":"申酉","丁丑":"申酉","戊寅":"申酉","己卯":"申酉","庚辰":"申酉","辛巳":"申酉","壬午":"申酉","癸未":"申酉","甲申":"午未","乙酉":"午未","丙戌":"午未","丁亥":"午未","戊子":"午未","己丑":"午未","庚寅":"午未","辛卯":"午未","壬辰":"午未","癸巳":"午未","甲午":"辰巳","乙未":"辰巳","丙申":"辰巳","丁酉":"辰巳","戊戌":"辰巳","己亥":"辰巳","庚子":"辰巳","辛丑":"辰巳","壬寅":"辰巳","癸卯":"辰巳","甲辰":"寅卯","乙巳":"寅卯","丙午":"寅卯","丁未":"寅卯","戊申":"寅卯","己酉":"寅卯","庚戌":"寅卯","辛亥":"寅卯","壬子":"寅卯","癸丑":"寅卯","甲寅":"子丑","乙卯":"子丑","丙辰":"子丑","丁巳":"子丑","戊午":"子丑","己未":"子丑","庚申":"子丑","辛酉":"子丑","壬戌":"子丑","癸亥":"子丑"}
/// DYZZ : {"甲子":"沐浴","乙丑":"衰","丙寅":"长生","丁卯":"病","戊辰":"冠带","己巳":"帝旺","庚午":"沐浴","辛未":"衰","壬申":"长生","癸酉":"病","甲戌":"养","乙亥":"死","丙子":"胎","丁丑":"墓","戊寅":"长生","己卯":"病","庚辰":"养","辛巳":"死","壬午":"胎","癸未":"墓","甲申":"绝","乙酉":"绝","丙戌":"墓","丁亥":"胎","戊子":"胎","己丑":"墓","庚寅":"绝","辛卯":"绝","壬辰":"墓","癸巳":"胎","甲午":"死","乙未":"养","丙申":"病","丁酉":"长生","戊戌":"墓","己亥":"胎","庚子":"死","辛丑":"养","壬寅":"病","癸卯":"长生","甲辰":"衰","乙巳":"沐浴","丙午":"帝旺","丁未":"冠带","戊申":"病","己酉":"长生","庚戌":"衰","辛亥":"沐浴","壬子":"帝旺","癸丑":"冠带","甲寅":"临官","乙卯":"临官","丙辰":"冠带","丁巳":"帝旺","戊午":"帝旺","己未":"冠带","庚申":"临官","辛酉":"临官","壬戌":"冠带","癸亥":"帝旺"}
/// DYNY : {"甲子":"海中金","乙丑":"海中金","丙寅":"炉中火","丁卯":"炉中火","戊辰":"大林木","己巳":"大林木","庚午":"路旁土","辛未":"路旁土","壬申":"剑锋金","癸酉":"剑锋金","甲戌":"山头火","乙亥":"山头火","丙子":"涧下水","丁丑":"涧下水","戊寅":"城头土","己卯":"城头土","庚辰":"白腊金","辛巳":"白腊金","壬午":"杨柳木","癸未":"杨柳木","甲申":"泉中水","乙酉":"泉中水","丙戌":"屋上土","丁亥":"屋上土","戊子":"霹雳火","己丑":"霹雳火","庚寅":"松柏木","辛卯":"松柏木","壬辰":"长流水","癸巳":"长流水","甲午":"沙中金","乙未":"沙中金","丙申":"山下火","丁酉":"山下火","戊戌":"平地木","己亥":"平地木","庚子":"壁上土","辛丑":"壁上土","壬寅":"金箔金","癸卯":"金箔金","甲辰":"覆灯火","乙巳":"覆灯火","丙午":"天河水","丁未":"天河水","戊申":"大驿土","己酉":"大驿土","庚戌":"钗钏金","辛亥":"钗钏金","壬子":"桑柘木","癸丑":"桑柘木","甲寅":"大溪水","乙卯":"大溪水","丙辰":"沙中土","丁巳":"沙中土","戊午":"天上火","己未":"天上火","庚申":"石榴木","辛酉":"石榴木","壬戌":"大海水","癸亥":"大海水"}
/// LNXY : {"2024":"癸丑","2025":"甲寅","2026":"乙卯","2027":"丙辰","2028":"丁巳","2029":"戊午","2030":"己未","2031":"庚申","2032":"辛酉","2033":"壬戌","2034":"癸亥","2035":"甲子","2036":"乙丑","2037":"丙寅","2038":"丁卯","2039":"戊辰","2040":"己巳","2041":"庚午","2042":"辛未","2043":"壬申","2044":"癸酉","2045":"甲戌","2046":"乙亥","2047":"丙子","2048":"丁丑","2049":"戊寅","2050":"己卯","2051":"庚辰","2052":"辛巳","2053":"壬午","2054":"癸未","2055":"甲申","2056":"乙酉","2057":"丙戌","2058":"丁亥","2059":"戊子","2060":"己丑","2061":"庚寅","2062":"辛卯","2063":"壬辰","2064":"癸巳","2065":"甲午","2066":"乙未","2067":"丙申","2068":"丁酉","2069":"戊戌","2070":"己亥","2071":"庚子","2072":"辛丑","2073":"壬寅","2074":"癸卯","2075":"甲辰","2076":"乙巳","2077":"丙午","2078":"丁未","2079":"戊申","2080":"己酉","2081":"庚戌","2082":"辛亥","2083":"壬子","2084":"癸丑","2085":"甲寅","2086":"乙卯","2087":"丙辰","2088":"丁巳","2089":"戊午","2090":"己未","2091":"庚申","2092":"辛酉","2093":"壬戌","2094":"癸亥","2095":"甲子","2096":"乙丑","2097":"丙寅","2098":"丁卯","2099":"戊辰","2100":"己巳","2101":"庚午","2102":"辛未","2103":"壬申","2104":"癸酉","2105":"甲戌","2106":"乙亥","2107":"丙子","2108":"丁丑","2109":"戊寅","2110":"己卯","2111":"庚辰","2112":"辛巳","2113":"壬午","2114":"癸未","2115":"甲申","2116":"乙酉","2117":"丙戌","2118":"丁亥"}
/// gl_birthday : "2024-3-20+0: 0"

SplayedFigureModel splayedFigureModelFromJson(String str) => SplayedFigureModel.fromJson(json.decode(str));
String splayedFigureModelToJson(SplayedFigureModel data) => json.encode(data.toJson());
class SplayedFigureModel {
  SplayedFigureModel({
      num? fanhui, 
      String? vip, 
      List<String>? deling, 
      System? system,
    dynamic? bz,
      String? gwgx, 
      Fx? fx, 
      Chusheng? chusheng,
    dynamic? dzss,
    dynamic? zGss,
      Bazixinxi? bazixinxi, 
      Jsfw? jsfw, 
      List<num>? lndy, 
      Ss? ss,
    dynamic? llss,
    dynamic? dyws,
    dynamic? dykw,
    dynamic? dyzz,
    dynamic? dyny,
    dynamic? lnxy,
      String? glBirthday,}){
    _fanhui = fanhui;
    _vip = vip;
    _deling = deling;
    _system = system;
    _bz = bz;
    _gwgx = gwgx;
    _fx = fx;
    _chusheng = chusheng;
    _dzss = dzss;
    _zGss = zGss;
    _bazixinxi = bazixinxi;
    _jsfw = jsfw;
    _lndy = lndy;
    _ss = ss;
    _llss = llss;
    _dyws = dyws;
    _dykw = dykw;
    _dyzz = dyzz;
    _dyny = dyny;
    _lnxy = lnxy;
    _glBirthday = glBirthday;
}

  SplayedFigureModel.fromJson(dynamic json) {
    _fanhui = json['fanhui'];
    _vip = json['vip'];
    _deling = json['deling'] != null ? json['deling'].cast<String>() : [];
    _system = json['system'] != null ? System.fromJson(json['system']) : null;
    _bz = json['BZ'] != null ? json['BZ'] : null;
    _gwgx = json['gwgx'];
    _fx = json['FX'] != null ? Fx.fromJson(json['FX']) : null;
    _chusheng = json['chusheng'] != null ? Chusheng.fromJson(json['chusheng']) : null;
    _dzss = json['DZSS'] != null ? json['DZSS'] : null;
    _zGss = json['ZGss'] != null ? json['ZGss'] : null;
    _bazixinxi = json['bazixinxi'] != null ? Bazixinxi.fromJson(json['bazixinxi']) : null;
    _jsfw = json['JSFW'] != null ? Jsfw.fromJson(json['JSFW']) : null;
    _lndy = json['LNDY'] != null ? json['LNDY'].cast<num>() : [];
    _ss = json['SS'] != null ? Ss.fromJson(json['SS']) : null;
    _llss = json['LLSS'] != null ? json['LLSS'] : null;
    _dyws = json['DYWS'] != null ? json['DYWS'] : null;
    _dykw = json['DYKW'] != null ? json['DYKW'] : null;
    _dyzz = json['DYZZ'] != null ? json['DYZZ'] : null;
    _dyny = json['DYNY'] != null ? json['DYNY'] : null;
    _lnxy = json['LNXY'] != null ? json['LNXY']: null;
    _glBirthday = json['gl_birthday'];
  }
  num? _fanhui;
  String? _vip;
  List<String>? _deling;
  System? _system;
  dynamic? _bz;
  String? _gwgx;
  Fx? _fx;
  Chusheng? _chusheng;
  dynamic? _dzss;
  dynamic? _zGss;
  Bazixinxi? _bazixinxi;
  Jsfw? _jsfw;
  List<num>? _lndy;
  Ss? _ss;
  dynamic? _llss;
  dynamic? _dyws;
  dynamic? _dykw;
  dynamic? _dyzz;
  dynamic? _dyny;
  dynamic? _lnxy;
  String? _glBirthday;
SplayedFigureModel copyWith({  num? fanhui,
  String? vip,
  List<String>? deling,
  System? system,
  dynamic? bz,
  String? gwgx,
  Fx? fx,
  Chusheng? chusheng,
  dynamic? dzss,
  dynamic? zGss,
  Bazixinxi? bazixinxi,
  Jsfw? jsfw,
  List<num>? lndy,
  Ss? ss,
  dynamic? llss,
  dynamic? dyws,
  dynamic? dykw,
  dynamic? dyzz,
  dynamic? dyny,
  dynamic? lnxy,
  String? glBirthday,
}) => SplayedFigureModel(  fanhui: fanhui ?? _fanhui,
  vip: vip ?? _vip,
  deling: deling ?? _deling,
  system: system ?? _system,
  bz: bz ?? _bz,
  gwgx: gwgx ?? _gwgx,
  fx: fx ?? _fx,
  chusheng: chusheng ?? _chusheng,
  dzss: dzss ?? _dzss,
  zGss: zGss ?? _zGss,
  bazixinxi: bazixinxi ?? _bazixinxi,
  jsfw: jsfw ?? _jsfw,
  lndy: lndy ?? _lndy,
  ss: ss ?? _ss,
  llss: llss ?? _llss,
  dyws: dyws ?? _dyws,
  dykw: dykw ?? _dykw,
  dyzz: dyzz ?? _dyzz,
  dyny: dyny ?? _dyny,
  lnxy: lnxy ?? _lnxy,
  glBirthday: glBirthday ?? _glBirthday,
);
  num? get fanhui => _fanhui;
  String? get vip => _vip;
  List<String>? get deling => _deling;
  System? get system => _system;
  dynamic? get bz => _bz;
  String? get gwgx => _gwgx;
  Fx? get fx => _fx;
  Chusheng? get chusheng => _chusheng;
  dynamic? get dzss => _dzss;
  dynamic? get zGss => _zGss;
  Bazixinxi? get bazixinxi => _bazixinxi;
  Jsfw? get jsfw => _jsfw;
  List<num>? get lndy => _lndy;
  Ss? get ss => _ss;
  dynamic? get llss => _llss;
  dynamic? get dyws => _dyws;
  dynamic? get dykw => _dykw;
  dynamic? get dyzz => _dyzz;
  dynamic? get dyny => _dyny;
  dynamic? get lnxy => _lnxy;
  String? get glBirthday => _glBirthday;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['fanhui'] = _fanhui;
    map['vip'] = _vip;
    map['deling'] = _deling;
    if (_system != null) {
      map['system'] = _system?.toJson();
    }
    if (_bz != null) {
      map['BZ'] = _bz?.toJson();
    }
    map['gwgx'] = _gwgx;
    if (_fx != null) {
      map['FX'] = _fx?.toJson();
    }
    if (_chusheng != null) {
      map['chusheng'] = _chusheng?.toJson();
    }
    if (_dzss != null) {
      map['DZSS'] = _dzss?.toJson();
    }
    if (_zGss != null) {
      map['ZGss'] = _zGss?.toJson();
    }
    if (_bazixinxi != null) {
      map['bazixinxi'] = _bazixinxi?.toJson();
    }
    if (_jsfw != null) {
      map['JSFW'] = _jsfw?.toJson();
    }
    map['LNDY'] = _lndy;
    if (_ss != null) {
      map['SS'] = _ss?.toJson();
    }
    if (_llss != null) {
      map['LLSS'] = _llss?.toJson();
    }
    if (_dyws != null) {
      map['DYWS'] = _dyws?.toJson();
    }
    if (_dykw != null) {
      map['DYKW'] = _dykw?.toJson();
    }
    if (_dyzz != null) {
      map['DYZZ'] = _dyzz?.toJson();
    }
    if (_dyny != null) {
      map['DYNY'] = _dyny?.toJson();
    }
    if (_lnxy != null) {
      map['LNXY'] = _lnxy?.toJson();
    }
    map['gl_birthday'] = _glBirthday;
    return map;
  }

}


/// NZSC : ["华盖","月德贵人","金舆","天扫星","五鬼精神煞"]
/// YZSC : ["将星","六厄","福星贵人","文昌贵人","天乙贵人","病符","埋儿煞","平头煞","悬梁关"]
/// RZSC : ["华盖","太极贵人","天官贵人","天乙贵人","血刃","十灵日","勾煞","水溺煞","五鬼星","悬梁关","悬梁煞","华盖自墓"]
/// SZSC : ["白虎兼刃","将星","披头煞","桃花","福星贵人","太极贵人","禄神","九丑日","童子","平头煞","五鬼关","原局桃花","急脚关","劫路"]

Ss ssFromJson(String str) => Ss.fromJson(json.decode(str));
String ssToJson(Ss data) => json.encode(data.toJson());
class Ss {
  Ss({
      List<String>? nzsc, 
      List<String>? yzsc, 
      List<String>? rzsc, 
      List<String>? szsc,}){
    _nzsc = nzsc;
    _yzsc = yzsc;
    _rzsc = rzsc;
    _szsc = szsc;
}

  Ss.fromJson(dynamic json) {
    _nzsc = json['NZSC'] != null ? json['NZSC'].cast<String>() : [];
    _yzsc = json['YZSC'] != null ? json['YZSC'].cast<String>() : [];
    _rzsc = json['RZSC'] != null ? json['RZSC'].cast<String>() : [];
    _szsc = json['SZSC'] != null ? json['SZSC'].cast<String>() : [];
  }
  List<String>? _nzsc;
  List<String>? _yzsc;
  List<String>? _rzsc;
  List<String>? _szsc;
Ss copyWith({  List<String>? nzsc,
  List<String>? yzsc,
  List<String>? rzsc,
  List<String>? szsc,
}) => Ss(  nzsc: nzsc ?? _nzsc,
  yzsc: yzsc ?? _yzsc,
  rzsc: rzsc ?? _rzsc,
  szsc: szsc ?? _szsc,
);
  List<String>? get nzsc => _nzsc;
  List<String>? get yzsc => _yzsc;
  List<String>? get rzsc => _rzsc;
  List<String>? get szsc => _szsc;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['NZSC'] = _nzsc;
    map['YZSC'] = _yzsc;
    map['RZSC'] = _rzsc;
    map['SZSC'] = _szsc;
    return map;
  }

}

/// zg : "巽卦(东四命)"
/// b : "生气"
/// db : "绝命"
/// d : "延年"
/// dn : "伏位"
/// n : "天医"
/// xn : "五鬼"
/// x : "六煞"
/// xb : "祸害"

Jsfw jsfwFromJson(String str) => Jsfw.fromJson(json.decode(str));
String jsfwToJson(Jsfw data) => json.encode(data.toJson());
class Jsfw {
  Jsfw({
      String? zg, 
      String? b, 
      String? db, 
      String? d, 
      String? dn, 
      String? n, 
      String? xn, 
      String? x, 
      String? xb,}){
    _zg = zg;
    _b = b;
    _db = db;
    _d = d;
    _dn = dn;
    _n = n;
    _xn = xn;
    _x = x;
    _xb = xb;
}

  Jsfw.fromJson(dynamic json) {
    _zg = json['zg'];
    _b = json['b'];
    _db = json['db'];
    _d = json['d'];
    _dn = json['dn'];
    _n = json['n'];
    _xn = json['xn'];
    _x = json['x'];
    _xb = json['xb'];
  }
  String? _zg;
  String? _b;
  String? _db;
  String? _d;
  String? _dn;
  String? _n;
  String? _xn;
  String? _x;
  String? _xb;
Jsfw copyWith({  String? zg,
  String? b,
  String? db,
  String? d,
  String? dn,
  String? n,
  String? xn,
  String? x,
  String? xb,
}) => Jsfw(  zg: zg ?? _zg,
  b: b ?? _b,
  db: db ?? _db,
  d: d ?? _d,
  dn: dn ?? _dn,
  n: n ?? _n,
  xn: xn ?? _xn,
  x: x ?? _x,
  xb: xb ?? _xb,
);
  String? get zg => _zg;
  String? get b => _b;
  String? get db => _db;
  String? get d => _d;
  String? get dn => _dn;
  String? get n => _n;
  String? get xn => _xn;
  String? get x => _x;
  String? get xb => _xb;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['zg'] = _zg;
    map['b'] = _b;
    map['db'] = _db;
    map['d'] = _d;
    map['dn'] = _dn;
    map['n'] = _n;
    map['xn'] = _xn;
    map['x'] = _x;
    map['xb'] = _xb;
    return map;
  }

}

/// zh : [[0,2,3,1,2],[4,4],[50,50],[0,3,2,1,2],[1,7],[88,13],"未落空"]
/// ZaoShi : "湿"
/// wanzishiliupai : "按明天"
/// bazishengyue : "惊蛰之时，飞龙在天，利见大人，利路亨通，作事大与，有机可称，正是出头之时，德望成功，终成大业，竟天才成功之守，地位权位受人敬仰，有冲天之势，威镇山河。"

Bazixinxi bazixinxiFromJson(String str) => Bazixinxi.fromJson(json.decode(str));
String bazixinxiToJson(Bazixinxi data) => json.encode(data.toJson());
class Bazixinxi {
  Bazixinxi({
      List<dynamic>? zh,
      String? zaoShi, 
      String? wanzishiliupai, 
      String? bazishengyue,}){
    _zh = zh;
    _zaoShi = zaoShi;
    _wanzishiliupai = wanzishiliupai;
    _bazishengyue = bazishengyue;
}

  Bazixinxi.fromJson(dynamic json) {
    _zh = json['zh'] != null ? json['zh']:[];
    _zaoShi = json['ZaoShi'];
    _wanzishiliupai = json['wanzishiliupai'];
    _bazishengyue = json['bazishengyue'];
  }
  List<dynamic>? _zh;
  String? _zaoShi;
  String? _wanzishiliupai;
  String? _bazishengyue;
Bazixinxi copyWith({  List<List<num>>? zh,
  String? zaoShi,
  String? wanzishiliupai,
  String? bazishengyue,
}) => Bazixinxi(  zh: zh ?? _zh,
  zaoShi: zaoShi ?? _zaoShi,
  wanzishiliupai: wanzishiliupai ?? _wanzishiliupai,
  bazishengyue: bazishengyue ?? _bazishengyue,
);
  List<dynamic>? get zh => _zh;
  String? get zaoShi => _zaoShi;
  String? get wanzishiliupai => _wanzishiliupai;
  String? get bazishengyue => _bazishengyue;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['zh'] = _zh;
    map['ZaoShi'] = _zaoShi;
    map['wanzishiliupai'] = _wanzishiliupai;
    map['bazishengyue'] = _bazishengyue;
    return map;
  }

}





/// gongli : "2024年3月20日0时0分"
/// nongli : "二〇二四年二月十一子时"
/// DL1 : "惊蛰"
/// CL1 : "清明"
/// DL2 : "2024-03-05 10: 22: 43"
/// CL2 : "2024-04-04 15: 02: 15"
/// QY : "5年2个月20天"
/// HYWS : "9"
/// WXWS : "木旺 火相 水休 金囚 土死"
/// QH : {"冬至":"2023-12-22 11: 27: 20","小寒":"2024-01-06 04: 49: 20","大寒":"2024-01-20 22: 07: 20","立春":"2024-02-04 16: 27: 05","雨水":"2024-02-19 12: 13: 10","惊蛰":"2024-03-05 10: 22: 43","春分":"2024-03-20 11: 06: 23","清明":"2024-04-04 15: 02: 15","谷雨":"2024-04-19 21: 59: 44","立夏":"2024-05-05 08: 10: 03","小满":"2024-05-20 20: 59: 29","芒种":"2024-06-05 12: 09: 52","夏至":"2024-06-21 04: 50: 58","小暑":"2024-07-06 22: 20: 01","大暑":"2024-07-22 15: 44: 24","立秋":"2024-08-07 08: 09: 13","处暑":"2024-08-22 22: 55: 01","白露":"2024-09-07 11: 11: 18","秋分":"2024-09-22 20: 43: 39","寒露":"2024-10-08 02: 59: 55","霜降":"2024-10-23 06: 14: 45","立冬":"2024-11-07 06: 20: 02","小雪":"2024-11-22 03: 56: 29","大雪":"2024-12-06 23: 17: 00"}

Chusheng chushengFromJson(String str) => Chusheng.fromJson(json.decode(str));
String chushengToJson(Chusheng data) => json.encode(data.toJson());
class Chusheng {
  Chusheng({
      String? gongli, 
      String? nongli, 
      String? dl1, 
      String? cl1, 
      String? dl2, 
      String? cl2, 
      String? qy, 
      String? hyws, 
      String? wxws, 
      dynamic? qh,}){
    _gongli = gongli;
    _nongli = nongli;
    _dl1 = dl1;
    _cl1 = cl1;
    _dl2 = dl2;
    _cl2 = cl2;
    _qy = qy;
    _hyws = hyws;
    _wxws = wxws;
    _qh = qh;
}

  Chusheng.fromJson(dynamic json) {
    _gongli = json['gongli'];
    _nongli = json['nongli'];
    _dl1 = json['DL1'];
    _cl1 = json['CL1'];
    _dl2 = json['DL2'];
    _cl2 = json['CL2'];
    _qy = json['QY'];
    _hyws = json['HYWS'];
    _wxws = json['WXWS'];
    _qh = json['QH'] != null ? json['QH'] : null;
  }
  String? _gongli;
  String? _nongli;
  String? _dl1;
  String? _cl1;
  String? _dl2;
  String? _cl2;
  String? _qy;
  String? _hyws;
  String? _wxws;
  dynamic? _qh;
Chusheng copyWith({  String? gongli,
  String? nongli,
  String? dl1,
  String? cl1,
  String? dl2,
  String? cl2,
  String? qy,
  String? hyws,
  String? wxws,
  dynamic? qh,
}) => Chusheng(  gongli: gongli ?? _gongli,
  nongli: nongli ?? _nongli,
  dl1: dl1 ?? _dl1,
  cl1: cl1 ?? _cl1,
  dl2: dl2 ?? _dl2,
  cl2: cl2 ?? _cl2,
  qy: qy ?? _qy,
  hyws: hyws ?? _hyws,
  wxws: wxws ?? _wxws,
  qh: qh ?? _qh,
);
  String? get gongli => _gongli;
  String? get nongli => _nongli;
  String? get dl1 => _dl1;
  String? get cl1 => _cl1;
  String? get dl2 => _dl2;
  String? get cl2 => _cl2;
  String? get qy => _qy;
  String? get hyws => _hyws;
  String? get wxws => _wxws;
  dynamic? get qh => _qh;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['gongli'] = _gongli;
    map['nongli'] = _nongli;
    map['DL1'] = _dl1;
    map['CL1'] = _cl1;
    map['DL2'] = _dl2;
    map['CL2'] = _cl2;
    map['QY'] = _qy;
    map['HYWS'] = _hyws;
    map['WXWS'] = _wxws;
    if (_qh != null) {
      map['QH'] = _qh?.toJson();
    }
    return map;
  }

}


/// zncs : ["冠带临官三子位，男女宫中细端详","冬月腊月正月勿订结婚","生殖器粗长而直。","建议取名:瑗渊 瑗五行:金 瑗珠、瑗敬、瑗雅、瑗如、瑗勤、瑗琪。 渊五行:金 意为深、深水。福寿兴家，理智充足，慈样有德，环境良好，安享富贵。"]
/// KWSC2 : ["红颜薄命，多见不得良缘","这是一个盛衰起浮很大、凡事必须独立自主的命运！大都在中年期间可以平步青云，大显良机；技术、研究方面多见才能，或见成就","为人温顺，做事消极，较缺乏主张，做事经常半途而废此命内心多见烦忧，个性有欠开朗；思绪虽然极欲表态开朗，但难免忧豫、怅惘之憾","双亲恩薄，六亲缘浅，比朋难助，早年多苦，结婚运差","有收藏之癖好，多见在家安禅之士；一生防水厄之灾，远离为吉","才智过人，谋略远大，却显有志难伸之憾！做事只要按步就班、步步为营，反而容易成功；若是谋略太多，反见一事无成","欠缺活动力，多忧苦，个性欠朗，易烦心，乏耐力，多见半途而废，多学而不专","双亲缘浅，早见背景离乡，备具艰辛居所不定，常见搬家，浪荡不定；大都中年后可见好转","最需开展交际，面带微笑","穷通宝鉴调候用神参考:乙木司令,专用庚金,辛金为次。","三命通会日时断:生于申酉月，命主贵显。生于戌亥月，是大富大贵之命。生于寅卯月，孤伶。生于辰巳月，命主凶恶。忌壬申月，身有残疾，命主不利；庚辰月，受凶刑破；乙丑月，柱失土气，命主凶死。","伤官坐正官，主凶，骂人成癖，万事止滞，权柄复失，夫妻离别，亦为凶象配置也。","偏财坐食神，大吉，则为遇食增福，生涯顺遂，多利多益，得父或妾之助而发达。为官运途中享通，经商营业，繁荣昌盛。","劫财坐比肩，不吉，家事婚事不顺，为兄弟亲友劳苦。若女命因丈夫品行不正而烦恼。","癸日主：其个性是逞强顽固，是努力家，有耐力，热情大方，聪颖机灵，但心地狭窄，容易小气。","食神心性：优点：智慧聪明，有才华，气质高雅，重精神和物质之均衡发展。为人温和，通情达理，不与人争，思想脱俗，对精神生活追求很有目标。感情强，爱好文艺歌舞，凡事能预先为长远打算。亦主有口福，善烹调。缺点：理想高远，易致超脱现实。耐性虽有，体力不足。喜幻想，不喜被拘束。思想清高，自负不凡，内心常觉空虚寂寞。喜吃零食，喜烹调，对饮食文化有一定见解，在外吃饭机会多。","前年五月受胎，惊蛰节后出生。性格纯良温婉，对人从无恶语相加，但嫌六亲少缘，父母兄弟姊妹乏其助力，初限艰苦，处处靠自力更生，循步渐进，可望百尺竿头，蒸蒸日上，中年过后，家运事业皆见兴隆，凡事不宜急躁，尤戒贪婪，贪则失误，为色情而害家庭，宜要谨慎得荣幸。晚运一般 ，真假各半之命。","十一生人，性格随和，善解人意，远迟开发，早年艰辛，中年衣食有余，独惜六亲不得其力，兄弟亦未得其助，晚年能享天伦之乐，乃中平之命也。","子时生人，玉扇星，财库入命，为人性格刚强，孤独自负，有勇欠谋，是非多端，小事不拘，父母得力，夫妇相克，初年好学上进，中运奔波，晚运富贵，乃公卿之命也，运到好如春，叶绿花更红。*适业：军人、政法、经济、建筑、电气等，金水事业佳，忌土类。*吉凶年：十一、十八、三十六、四十九、五十八、八十四岁。"]
/// gz : "四两"
/// cgg : "平生衣禄是绵长，件件心中自主张，前面风霜多受过，后来必定享安康"
/// cggj : "晚年有福"
/// cgjs : "命主出生在大富大贵之家，不仅衣食富裕、身体健康，加上自己独立自主性很强，因此财运事业都不错。就算遇到再大的困难，只要凭借自己的意志力克服，狂风暴雨之后必定是海阔天空。"
/// qiongtongbaojian : "二月癸水，不刚不柔，但因乙木司令，泄弱无神，专用庚金为妙，辛金佐之。癸水至二月死地，休囚之极，加以乙木司令，泄弱元神，故专用庚辛破木而发水源，庚辛并用者，恐乙庚相合，更佐之以辛也。庚辛俱透，无丁出干者，科甲富贵，无庚辛贫贱常人，或庚透辛藏，异途位高，辛透庚藏，生员禀贡，庚辛两藏，富中取贵，异途显达，刀笔名高。二月癸水，水木伤官为体，木神当旺，不能不佩印，无庚用辛，不必拘执，二月阳气舒伸，无形中自有丙丁，故不必明见丙丁，亦可取贵也。或庚辛太多，得己丁两透，作大贵论。此言体用之变，庚辛太多，癸水弱变为强，月令乙木被克无力，取财官相生为用，作大贵推，乙藏己透，偏官无伤，庚辛金多，不能无丁制之，癸水至弱，柱无壬劫出干，不能用戊土，故取丁己也。或支成木局，时月又有木出干，此泄水太过，穷困多灾，即运入西方，亦不甚清泰，无用之人。支成木局，不见庚辛，为顺局从儿，一女造，甲寅，丁卯，癸卯，乙卯，诰封一品，但为人怯懦无能，运入西方逝世，女造柔懦尚无害，若为男造，不免贫困多灾矣。甲申，丁卯，癸亥，癸亥。贡士，大富，盖用庚得禄地，有在才略，且多肖子。按此造癸水通根申亥，反弱为强，惜无己土，用食伤生财，故富，支见申庚，旺木有制，故用丁火，非用庚也。丙辰，辛卯，癸酉，癸亥。用辛金，飞天禄马格，尚书。丁未，癸卯，癸亥，癸丑。飞天禄马格，拜相。飞天禄马格，以亥冲巳，酉丑合住巳字为要点，两造皆似是而非，特飞天禄马，本有伤官变格，谓为成格，亦无不可，总之木多水泄，不能无金，两造皆以辛金为用也。丁亥，癸卯，癸卯，癸丑。用丑中辛金，又丁火出干，侍郎。按与丁未造，大致相同。庚寅，己卯，癸亥，庚申。专用庚金，故佐君泽民，神钦鬼服。按此造喜寅中暗藏丙火，用庚金，有阴阳和谐之妙，胎元庚午，以丁己财官为用也。庚子，己卯，癸卯，辛酉。庚辛两透，位至阁老。按庚辛并见，而无丙丁，虽科甲正途，终嫌阴柔奸险，此明代严嵩命造也，支备子卯酉，加胎元庚午，成格而备四极，故其奸险之祸，亦加於四海，午宫己土得禄，财官相生为用，格虽大贵，究不足取。癸卯，乙卯，癸卯，己未。乙木重重，有克己之势，无克己之力，盖因未内藏丁，泄乙而生己也，故名列宫墙。癸卯，乙卯，癸巳，甲寅。宜用庚金，因巳中丙制庚，破去用神，故一生劳碌，不能处世。按以上两造，皆缘木旺无金，癸水元神泄弱，不足以任财官也。以上造化元钥。丁酉，癸卯，癸卯，辛酉。此为明穆宗隆庆命，有印比生助，帝皇之位，专恃荫庇，胎元甲午，食神生财为用，运行西北，毫无作为，一生享荫庇福而已。辛巳，辛卯，癸丑，乙卯。光绪七年二月廿一日卯时。章士钊命：丑宫己辛，煞印相生，辛透丙藏，位至教育总长。戊子，乙卯，癸未，庚申。光绪十四年二月初一日申时。石某命：时逢庚申，癸水反弱为旺，月令乙卯，见庚输情相合，专用未中丁火，破庚金印，生己土煞，戊土虚浮，又为旺木所伤，用煞不用官，故为武贵年时遥合，自幼游历欧美十七邦，归国授军少将。"
/// ditiansui : "癸水至弱，达于天津。得龙而运，功化斯神。不愁火土，不论庚辛。合戊见火，化象斯真。原注：癸水乃阴之纯而至弱，故扶桑有弱水也。达于天津，随天而运，得龙以成云雨，乃能润泽万物，功化斯神。凡柱中有甲乙寅卯，皆能运水气，生木制火，润土养金，定为贵格，火土虽多不畏。至于庚金，则不赖蜞生，亦不忌其多。惟合戊土化火也，戊生寅，癸生卯，皆属东方，故能生火。此固一说也，不知地不满东南，戊土之极处，即癸水之尽处，乃太阳起方也，故化火。凡戊癸得丙丁透者，不论衰旺，秋冬皆能化火，最为真也。任氏曰：癸水非雨露之谓，乃纯阴之水。发源虽长，其性极弱，其势最静，能润土养金，发育万物，得龙而运，变化不测。所谓逢龙即化，龙即辰也，非真龙而能变化也。得辰而化者，化辰之原神发露也，凡十干逢辰位，必干透化神，此一定不易之理也。不愁火土者，至弱之性，见火土多即从化矣；不论庚辛者，弱水不能泄金气，所谓金多反浊，癸水是也。合戊见火者，阴极则阳生，戊土燥厚，柱中得丙火透露，引出化神，乃为真也。若秋冬金水旺地，纵使支遇辰龙，干透丙丁，亦难从化，宜细详之。"
/// sanmingtonghui1 : "六癸日生时壬子，青云得路最为奇；若无己土冲克破，自有功名显达时。癸日壬子时，日禄归时，癸水子上建禄，若年月干支无戊己午未字刑冲破害，三元有倚托，通月气者，文章秀丽，官职显达；若通木气月，亦贵。如柱透己，有甲合，亦贵。否则，反覆。癸未日壬子时，申酉月，贵。戌亥，大富贵。寅卯，孤。辰巳，凶。忌壬申月，身不全，凶；庚辰月，凶刑；乙丑月，失土凶死。日禄归时局中得，食神喜遇怕刑冲；伤官莫道伤财运，官不加兮财不丰。癸日时临壬子，名为归禄格同，家门白屋也峥嵘，玄武当权禄重。水清宝瓶益盛，文章博览多通，荣迁来历紫薇封，甲午寅亥破动。"
/// sanmingtonghui2 : "癸水属阴，乃大海无涯之水，不能生长万物。一云雨露润泽之水，滋助万物。喜春秋间，运行巳午戌地，发福非常。大忌辰戌丑未运，成败。地支亥卯未合，伤旺益财。无寅甲，亦发名利，如见己土丑未月，更带三刑，平常衣禄，初中未济，终末荣发。若五行有救，身旺，运喜财官，亦主贵显。壬癸日生水为主，根基惟在火与土。春秋来往发财官，冬夏东行为得所。壬癸日生，坐下辰戌丑未巳午，为玄武当权。运行宜火木分野，过与不及，偏阴偏阳，则贵而不实。若生四季巳午月，引亥子时；或冬生，引辰戌丑未巳午时，俱贵。非此时，虚名虚利。运喜金水分野，生助为荣。无金则水绝。忌比肩劫财。冬十一月三合结局，水涨横泛而土崩。故水无土则滥，土无水则干。土得水而受润通气，水得土而成堤为河，二者不可偏倚。若更气运得宜，无不贵显。其刑合、拱合等格不在此论。六癸日用丙丁为财，戊正官，己偏官。若四柱透丙丁戊字，生九夏四季火土局，财官有用，若无此三字，生九夏四季火土局中，亦作财官论。见壬癸夺财，甲伤官，不利。若生春冬水木局中，财官无气。喜行南方四季财官之运。怕官煞混杂，有煞无制，鬼论；制太过，凶。更详日干于月令内有无力助，轻重言之。运喜忌同上。"
/// sanmingtonghui3 : " "
/// sanmingtonghui4 : "春月之水，孰不谓其病寅死卯墓辰为至弱矣，殊不知水为阴气，生申旺子。秋冬之时，其气翕聚未散，故水常涸，春至，阳气上蒸，阴气下降，故雨露既濡而水生发，此水势之常耳。星家以活水生于卯者，良有以也。晴则春水溶溶，雨则汪洋泛滥。二、三月之水，浩无边际，见土则有堤防，昼则富贵，夜则流移，生于谷雨后者，或主淫邪痹惫之疾，盖土浑水浊故也。见火则水火相刑，灾讼不免。遇金生水，泛滥无情，徐、扬人干支得土者，无咎。见木泄之，能施惠及人。兖、青人生于二月中旬者，木气正旺，盗其元神，则生风怯之疾。得金助之，无患。"
/// bazitiyao1 : "癸水生来卯月中，无官无杀喜和同。顺行南地多清贵，恐入西方寿早终。"
/// bazitiyao2 : "癸水诗曰癸水应为雨露麽，根通亥子即江河。柱无坤坎还身弱，局有财官不尚多。申子辰全成上路，午寅戌备要中和。假饶火土生深夏，西北行程岂太过。"
/// bazitiyao3 : "卯宫诗曰卯木繁华气禀深，仲春难道不嫌金。庚辛叠见愁申酉，亥子重来忌癸壬。祸见六冲应落叶，喜逢三合便成林。若归时日秋金重，更向西行患不禁。"
/// shenfengtongkao1 : "古诗:临未则略应返朴。今译:火之余气，小有成就。"
/// shenfengtongkao2 : "古诗:生逢坎位带禄兮，四海名张。今译:水主智，晚年有才名。"
/// shenfengtongkao3 : "古诗:职禄俱全，官封印旺。今译:不取财，癸水之官是戊，癸水之印是庚，戊旺在巳午，庚申酉。古诗:少年败散，鬼病财微。今译:财微，水克火为财，火败在亥子，即是年上比劫坐禄。古诗:祖上名高，岁居有气。今译:年上财官有根。古诗:年中困塞，为失其时。今译:年柱地支财官坐绝。古诗:自坐衰乡有克者，脚膝之病。今译:日主无根，又见官杀旺，主有疾。古诗:自身健旺遇水兮，妻必先亏。今译:比劫会局又透壬癸，克妻。古诗:四水朝元有气也，身居八位。今译:四柱皆水成全水局，从旺，吉命。古诗:三元羸弱，支克而官职则卑。今译:月日时，日主无根，又见冲刑，则没有官禄之分。古诗:至老鳏居水盛也，火生绝处。今译:会水局夏生，透壬癸，难有佳妻。古诗:三妻二妾干杂兮，火旺金实。今译:天干丙丁财杂透，地支又见巳午未，主有女人缘。古诗:暗损多逢无救也，必应绝嗣。今译:地支多冲无和，子息迟。古诗:终身不遂，遇衰乡，迢迢东西。今译:日主无根者东奔西走。古诗:财到旺乡，重见兮，父母有失。今译:癸水财旺，是巳午未，火必克印（母）。古诗:鬼居本位，叠遇兮，流落身衰。今译:鬼，七杀，癸以己为七杀，天干两己，地支丑未多，难有安定之生涯。杀重身轻。古诗:长生土乡，无化也，难图厚利。今译:生于辰戌丑未月，天干戊癸合见和而不化，也无大利。古诗:生逢水旺，纵亏兮，亦有衣食。今译:水旺比劫多，虽然破财，也不会没有基本生涯。比劫破财不至于没有衣食。"
/// tianwuwuxian : "书谓五阴生处不为生，卽癸水生于卯月，卯为癸之长生，实际卯乃纯粹之木，有泄无生也，时逢壬水刼财，子水日禄，得声应气求之助，癸水弱而转强，不愁泄气，若甲乙透干，无金破木，无土尅水，伤食当旺，日主亦强，便是一清到底，大贵之命。"
/// wuxingjingji1 : "甲辰偏库之火，多火助之吉，所谓同气相救，以资其不足，若见戊辰戊戌木生之为贵格，忌壬辰壬戌丙午丁未水最毒。"
/// wuxingjingji2 : "癸未自库之木，生旺尤佳，虽乙丑金不能冲破，各归其根，而不相犯，忌庚戌乙未金。"
/// wuxingjingji3 : "【源远流清】水人见木为本利，得火相逢凶害至，更无火木见金神，决主少年登显秩。金为水本源，木得水滋，深为利用，见木却生火，火旺则反伤于金，五行中若无木火，但得金气发露，则生出水禄自然。【无救成凶】水人切忌戊申寅，截断根源主祸频，局内不逢金发露，平生波劫受艰辛。戊申戊寅乃土成实之地，水人生处受制，病处见鬼，故曰，截断根源，五行中若见魁罡，则鬼气无以化藏，水神如此，可谓困矣。【长鬼为殃】水人大怕火炎扬，寅午相逢转更忙，若见丙加辰戌位，定知夭折见悲伤。寅午乃火生旺之地，火炽可知，水神如此则竭矣，五行若见魁罡，如丙戌之类，水神之福转衰矣。（并太乙统记）"
/// wuxingjingji4 : "论水四时皆忌火多，火多则受竭，忌见冲刑，冲刑则横流，忌见土重，土重则不流，忌见金死，金死则水囚，忌木旺，木旺则水死。又云天倾西北，水之源，地陷东南，水之府。天倾西北，亥为水出之方，地陷东南，辰为纳水之海，逆流到申而作声，故水不西行，水多则溢，反散漫而多不足也，土年亦然，卯巳同。玉霄宝鉴云：水之性润下，逆则有声，顺则有容，年月日时，逆行十二辰者逆也，入格者主清贵有声誉，顺行十二辰者顺也，主有度量，有吉神扶助乃贵格。悟玄子云：水流清处遇冬天，壬癸难逢亥子全，最爱金生名秀气，偏惟败土浊根源一本云：偏为败土浊其源。李九万云：水不绝源，亦伏金而流远，水不可太过，过则反伤。沉芝云：水命动摇多主浊，注云：凡水命不要太旺，更逢冲破，主常俗之人，或阴人不爱旺，多主淫荡，爱自主自绝则吉。"
/// wuxingjingji5 : " "
/// wuxingjingji6 : "惊蛰二月节春分二月中二月坤为天德，甲为月德，己为月合，庚为月空，甲乙丙丁为月中秀气，支宜寅午戌亥卯未，畏见壬辛二干，申酉二位，损时之德。二月秀在甲乙亥卯未，及纳音木。丙丁寅午戌，及纳音火。二月卯木正旺，若逢申金，木绝其气，酉又破卯，有此者，不惟无贵，尤破祖业，多为贫下之人。凡禀月中秀气，却有损坏时日者，最紧切，盖日为引，时为用也。又须看中气，如中气后五日，即使将来者进，功成者退，此说十二月中气极要审详之。二月甲寅、甲辰、己亥、己卯、乙亥、乙卯、乙未，俱为秀气，宜审酌用之（广信集）。遇甲乙居寅辰未亥之上尤美也。如己在亥卯未上，亦为秀气，何也？如妻在夫家，随夫之姓也。若遇辛酉癸酉为破家之厄，缘金木之气，忌全金冲克，若时日遇之，遭刑不贱，纵有其德，终身不立，若遇丙丁，为和气通明之时，在木为花，轻盈而容，不能久也。如丙寅日、辛卯时，此从木之性，其气实而华，必为明达身容之士。如甲午日、丁卯时，此木弱火虚，遇时而不通，乃伎术工巧近贵之人，福不能久也。若遇壬癸冲注其木，兆能生养，常有不安，二月之候，死水浸活木故也。遇之安闲渐亨，不及富贵之地，若更其中藏土，必为疾厄之人，如水在甲申之纳音，壬辰之干，犹有位之人也。二月己酉日癸酉时，此水土俱遇死败之上，乃水土浑浊，如癸酉之金，损时之德，不惟下贱，更多残疾也。壬辰之水秀气不浊，甲申之水，隐金木交会，藏于阴而寄于甲，故不得为死水推之，遇此之时，巧拙须详引用言其轻重也。（神白经）"
/// lixuzhongmingshu1 : "甲辰禄马承，乃始壮之火，欲多生我，或会本源却无炎光之极，自然超卓，水轻而无土，亦可腾达矣。甲丙生寅，明我生气。"
/// lixuzhongmingshu2 : "癸未禄自备，为伐根之木，气败而体柔，不嫌金制，喜水之荣，及会元而借生主，乃重器成德之材。癸在巳中，喜逢甲乙。"
/// xiyongshencankao1 : "二月癸水，不刚不柔，乙木司令，泄弱元神，专用庚金为用，辛金次之，庚辛俱透，无丁出干者，贵由科甲，无庚辛者常人。或庚透辛藏，荣封有准，庚藏辛透，亦有衣衿，庚辛两藏，富中取贵，或刀笔扬名，或庚辛重见，有己丁出干者亦贵。或支成木局，月时又见木者，为泄水太过，定主贫困多灾，即运入西方，亦属无用。"
/// xiyongshencankao2 : "二月的癸水,不刚也不柔,乙木执掌时令,泄弱了日元,专以庚金为用神,辛金为其次。庚辛二金都透出,无丁火出现在天干的,贵显出自科甲;无庚辛金的,为常人。或者庚透出而辛伏藏,荣显受封是一定的;庚伏藏而辛透出,也可以成为秀才;庚和辛两者都伏藏,主从富中取贵,或者凭刀笔扬名;或者庚和辛重叠出现,有己土和丁火出现在天干的,也主贵显。或者地支会成木局,月柱时柱又出现木的,属于泄水太过,一定主贫困而多灾难,即使行运进入西方,也没有用处。"
/// rizhufenxi : {"日干心性":"逞强顽固,是努力家,有耐力,热情大方,聪颖机灵,但心地狭窄,容易小气。","日干支层次":"[癸未][中等]坐下有食神生财、财生杀，因坐偏财、七杀，故男女命逢癸未，重婚较多，但男女均漂亮，爱情专一。","日干支分析":"心急口快，为人伶俐；救人无恩，反招是非，曲直难辩，多有误会。有财无库，过眼烟云，财来财去，精打细算，可免祸灾；女人贤惠，勤俭持家；晚景平安。","性格分析":"癸有测量之意,水之阻的癸是指隆冬之时,草木枯萎一望无际,因而便于测量。有别于壬的大河性格,癸是指小溪,水沟的细细水流、池沼混浊的水,或在草木叶上栖息的露水。壬可以说是表现之水,而癸则是底层的深水,水的表面尽管明亮,但光线却很难射入水底,因此癸的人在内心深处始终稳藏了神秘的性格。癸日生的人性情平等、顺从,重视默默的努力,但是当努力不为人接受时,忍耐到极点后会爆发怒气。由于善于察言观色,并加以协调配合,因而有旺盛的服务精神。癸未日生的人初看粗枝大叶,事实上头脑极慎密,本人对此也有十分的自信,有玩弄权谋术数的倾向。","爱情分析":"你的命局中日干支相战，意味着你结婚后容易遇到一些不顺和挫折，在婚姻中有较多矛盾和痛苦。选择晚婚反而对你比较有利。由于日支主气十神为七杀，所以你未来的另一半身高方面表现的会比较优越，另一半是骨架较大、体型挺拔的类型。加上你的日支在辰，对方的长相较一般，气质稳重朴实。为人具备亲和力，心情开朗，让人想要接近，对感情充满浪漫的想象。男命相貌堂堂，女命面貌清秀，生活中容易有喜事发生。另一半家境较好，在感情中女方付出较多。一旦经济状况走低，二人则容易为财务问题而争吵不和。在感情中，您有独断独行的性格，喜欢有点刺激和浪漫的感情模式，主观意识比较强，性格有点顽固，在感情中您有保留个人威严的习惯，需要伴侣时刻绝对的尊重甚至追崇。而感情讲求两个人的融合，在感情中您与另一半的相处有较多碰撞，自己不愿意为另一半而改变或做出妥协，争吵较多，影响对感情的培养。因此，即便您的异性缘不错，但一旦进入关系，感情就容易不顺，需要及时调整自己的性格。","事业分析":"癸意味着地下水，因此他不会在人们看到的地方活动，而是在某个深处朴实工作，有许多保守的研究者是癸日出生的，他们不是爱女学生欢迎的王牌学者，而是朴实的累积成果。由于洞察力非常敏锐，很适合参谋工作，在团体中如果立他为副领袖，可以发挥智慧推展许多活动。在公司或组织中，癸型的人都擅长订定计划，并会完美的达成任务，加上他十分擅长于预先准备好各方面有利的话而圆满达成交涉，因此多活跃于幕后，成为所谓的谋士。水的流通也意味钱的流通，五行中土是不动产，而金则为动产。依此看来，癸很适合往金融业发展。此外，若论流通，人来人往的百货公司、超级市场、交通业、旅游业等也非常合适。癸的人特别擅长对人服务，因而介绍人、顾问、贩卖报纸等以服务为主体的行业全部都很适应。特别是甲年生的人最能发挥癸的服务性，饭店业、理容业也是这型人的得意业。服务业中凡是利用水性的行业如咖啡厅、酒吧点心店、餐厅、小吃店等都没问题。清凉饮料、牛奶、酒类业更是没话说的适合。此外，需要大量水的温泉、浴场、洗衣店等也是癸可选择的行业。水也可广义的解释成液体，因此也可考虑石油、汽油贩卖等相关职种。","财运分析":"癸也属水性，有很好的洞察力。这种类型的人多勤勉努力，不靠洞察力或先见力。也能够聚集努力的结晶，拥有钱财或不动产。赚得快花得快是人之常情，但这种类型的人却例外，钱财一旦到手，就会慎重、踏实的处理。例如在公司举办的“意见竞赛”中夺魁而得到的奖金，癸的人会把它存起来当成结婚资金，决不会把它用在吃喝上。想来这种类型的人深知“聚沙成塔”的各种滋味，知道钱的好处多多。除了正式的工作外，他们多半也尝试各种打工增加副收入。","健康分析":"癸位居十干之末，从健康运来看，已呈疲劳的状态。不过，他同时又孕育十干之首的甲，所以内含精力。尽管外观虚弱，但仍有十分强的健康运。癸中要属己年和乙年生的人最须留意，不要太过勉强自己，一旦觉得疲劳，应立刻休息。概括来说，癸的人较容易惟患肾脏系统的疾病。面呈黑色的人更须特别注意。"}
/// XingZuo : {"角色":"多愁善感的幻想家","月份":"2.19-3.20","特点":"浪漫梦幻","象":"水象","掌管宫位":"第十二宫","最大特征":"滥情","主管星":"海王星","性格特征":"神经质、健忘、多愁善感、想像丰富、自欺欺人等等都是双鱼座的形像词，不过双鱼座最大的优点是他有一颗善良的心，他最喜欢帮助人，愿意牺牲自己而为别人。\\n双鱼男\\n温柔多情的双鱼座男生，就是一典型的风流才子范。双鱼男充满了浪漫唯美的色彩，在你们的世界里拥有着对爱情美好得如童话般的追求。之于生活，双鱼男却知足常乐，只要得过且过即可。看似文弱不堪一击的双鱼男，面对困难险阻时却能迸发出惊人的不服输精神。只是在抉择面前，却又显得特别黔驴技穷。","优点":"不自私、善解人意\\n具有想象力、浪漫\\n感情丰富、温和有礼\\n心地仁慈、舍己为人\\n直觉力强、懂得包容\\n容易信赖别人、不多疑\\n仁慈、天真、富有同情心。","缺点":"容易受环境影响\\n粗心、浮躁、散漫\\n不切实际，幻想太多\\n缺乏理性，感情用事\\n没有足够的危机意识\\n缺乏面对现实的勇气\\n缺乏自信而意志薄弱\\n多愁善感、意志不坚定\\n优柔寡断、不善于理财\\n很容易养成说谎的习惯\\n容易陷入沮丧而不可自拔"}
/// YRJPFX : "(1)癸水日、卯月生者，水性不会太柔，亦不会太刚。卯之中，有乙木司令，生日之气泄出，我身变弱，故应专用庚金，辛金次之。庆、辛透出．且无丁字时，功名有望。\n(2))命中无庚、辛，且日干弱时．为“画饼充饥”之命。即无庚辛作为癸水之水源时，必为贱命。\n(3)有庚、辛两者之一．不论为明或睹，均可得名利，惟其力较差。与磨玉增光之理相同，需努力方得成功。\n(4)庚、辛俱藏时．为先富而后贵之命。可以笔墨而扬\n(5)地支成亥卯未之三合木届时，月时再逢木气，则漏气太过，定为贫命，灾厄多。举左女命一例示之：\n生年 甲 寅\n生月 丁 卯\n生日 癸 卯\n生时 乙 卯\n以上之命，为“从儿格”，为人柔懦无能，但亦为一精秀好命。逢西方之金运时，旺神被破，则身死。如此称为“旺神发怒”。"
/// GDLM : ["六宫","和尚之命","【诗曰】衣禄僧道门中依，看破红尘最相宜，姻缘好似花间露，三次应娶两次离。","【婚姻】论到婚姻，终身无缘，虽然迟娶，命中亦有刑克，而且内助不立。无妻若能强硬配合，最好两地相离，各息谋生，方可免去灾星。","【财运】正财平平，偏财有限，初运交进，无非依人为活，作事劳而无功。碌碌奔波过度，中运暮境，亦是百事难成。老能主张分明，有点恒心，足以自立基业。","【子息】命里孤单前定，虽然生有子，到头无一认亲，不但难延嗣续，而且徒增悲哭，若能广积阴德，善种心田，或可贻留后福，延接嗣续。","【禄位】诗书无缘，功名莫求，出门离祖，尚属相宜。东南两方，任君奔走，经商方可，但终不能博取大利，而且大权难得，无非替人做事，衣禄奔求，寿元花甲。"]
/// SCWG : ["简介：虽有一时的顺调发展基础不安定恐遭意外的灾祸有急变、急死、多风险的配置。【凶】","1、总论:配置不良或许能有一时的成功恐有意外变化好景不常应谨慎意外灾祸之发生更应修身养性来保住您的生命或财产。天运五行有助可成功立业。","2、性格:喜占上风容易得罪人凡事好争好斗易发生无谓的纠纷凡事忍让点戒除不必要的虚荣心做事详加考虑脚踏实地可保身心愉快。有好色之嫌。","3、意志:意志不坚定易受酒色迷惑但耐性尚佳可忍受失败的痛苦或意外的打击。","4、事业:费心尽力为家庭劳累如有一时的成就宜退守为安。","5、家庭:夫妻感情不睦应多忍耐免得姓名测试爱情破裂。","6、姓名测试爱情:男娶个性刚强之妻常有争吵难得幸福;女嫁有家庭责任感之夫但姓名测试爱情不美满。","7、子女:个性孤癖身体较虚弱。","8、社交:虽能言善道但性情急躁容易得罪人好面子不愿屈居人下恐有纠纷发生。","9、精神:有后顾之忧心神难得安宁。","10、财运:时好时坏财源不稳如能慎重行事老运财源可得。必须减少浪费之事。","11、健康:注意外伤腰酸脚痛心肌或血管硬化。女人有妇科病或难产。","12、老运:老境孤独较为操心但财源不缺。","健康运：严重地不安定有意外的灾难可导致财产、生命的损失。【凶】","成功运：受上级长辈的照顾关心能顺利成功发达。【吉】","人际关系：虚荣心强快热快冷无感情倾向多受外部刺激易浪费易外伤。数佳者可安全。【平】","性格：性急进。血气旺溢手腕灵敏富活动力。名利心甚重智谋才略具备感情锐猛有如燃火之气魄。但也有气狭者。大都富有成功运盛名一时。但也可能中途多生出支节。"]
/// liangtoqian : "解卦，芳草逢春格\n春来芳草依依绿，雪散纷纷见枯竹，空中群雁各东西，伤情独向滩边宿。雨里桃花风里烛，平生到此心未足，树头花发两三枝，一朵枝头红似玉。陆地行舟水未来，空将心事委尘埃，逢牛渐渐登云阁，跨马骑牛大路开。\n金鸾，天印，科名\n此星照命，乃福禄之星。科名之宿，如珠之命。自立规矩，自辟门庭。比如大海之舟，又似水中萍梗。有三般早：当家早，忧虑早，历事早；有三般迟：发禄迟，妻子迟，享福迟。只得命中有退神重重，若要名成\n（解）\n天鸾星\n壬子春草下塘（解）枉费心思，毫无意处。\n壬寅寒潭下钓（解）作事劳苦，所得甚微。\n天印星\n壬辰旱苗逢雨（解）虽则穷困，转机即在目前。\n壬午虫叶初黄（解）办事有实力，能兴家立业。\n名利星\n壬申华筵点灯（解）处境优游，名利兼收。\n壬戌月照寒潭（解）清闲自在，衣食不愁。\n判断\n此命乃名利之曜，福禄之星，自成规矩，自创门庭，风中败叶，水上浮萍，三迟三早之命，当家早，劳心早，忧虑早，发禄迟，妻子迟，享福迟，命中有救神，不犯官刑，凶事不成凶，好处不见好，若要事十全，直待寿年老。芳草逢春格\n春来芳草依然绿，雪里园花见枯木，亲生兄弟有如无，只为生业命孤独，雨里桃花风里烛，碌碌里无为是足，枝头花发两三枝，只许一枝红又绿。\n事业独撑持，成中有石皮，龙羊犬牛会，黄菊满东篱。\n基业\n陆地行舟去必难，空劳心事把门关，牵牛跨马登途远，雪路迢迢隔两山。\n兄弟\n空中群雁各东西，一个孤雁独自飞翔，明月清风多少兴，声声牧笛劝人归。\n行藏\n雨里天桃风里烛，平生到处心不足，桑榆茂处好归耕，野渡横舟莺出谷。\n婚姻\n一地鸳鸯水小浮，蒿居鸯懒困何休，的大欧鹭纷纷去，飞向白萍红蓼洲。\n子女\n花发树茂两三枝，双双伴叶销金玉，龙楼凤阁往来人，引多领群仙有清福。\n收成\n若遇牛羊方始闲，好骑牛背上青山，逍遥路上花如锦，月照梅花影过闲。"
/// gewuzhiyan : "癸未：洲泽湾曲之水也。\n坐於未库流为湾曲之象，人多假道学。\n心事有外清内蒙之象。\n最喜金水透出天干，亥卯会入地支。\n以成利达之美。\n若火土重逢多是遇而不遇。\n喜行金水木，忌火土库。\n\n<日元确论>\n癸未：此川泽曲湾之水也。\n癸坐未库。\n流月有湾曲。\n人领之，有智谋，有机变，最喜金水透出天干。\n亥卯会入地支以成利达之美。\n若火土重逢，多是遇而不遇。\n喜行金水木，忌行火土库。\n\n<生成造化>\n癸未为川泽湾曲之水。\n癸坐未库。\n流有湾曲。\n人领之有智谋，多权变。\n最喜金木透干，亥卯会枝，以成利达。\n若火土重逢遇而不遇。"

Fx fxFromJson(String str) => Fx.fromJson(json.decode(str));
String fxToJson(Fx data) => json.encode(data.toJson());
class Fx {
  Fx({
      List<String>? zncs, 
      List<String>? kwsc2, 
      String? gz, 
      String? cgg, 
      String? cggj, 
      String? cgjs, 
      String? qiongtongbaojian, 
      String? ditiansui, 
      String? sanmingtonghui1, 
      String? sanmingtonghui2, 
      String? sanmingtonghui3, 
      String? sanmingtonghui4, 
      String? bazitiyao1, 
      String? bazitiyao2, 
      String? bazitiyao3, 
      String? shenfengtongkao1, 
      String? shenfengtongkao2, 
      String? shenfengtongkao3, 
      String? tianwuwuxian, 
      String? wuxingjingji1, 
      String? wuxingjingji2, 
      String? wuxingjingji3, 
      String? wuxingjingji4, 
      String? wuxingjingji5, 
      String? wuxingjingji6, 
      String? lixuzhongmingshu1, 
      String? lixuzhongmingshu2, 
      String? xiyongshencankao1, 
      String? xiyongshencankao2,
    dynamic? rizhufenxi,
    dynamic? xingZuo,
      String? yrjpfx, 
      List<String>? gdlm, 
      List<String>? scwg, 
      String? liangtoqian, 
      String? gewuzhiyan,}){
    _zncs = zncs;
    _kwsc2 = kwsc2;
    _gz = gz;
    _cgg = cgg;
    _cggj = cggj;
    _cgjs = cgjs;
    _qiongtongbaojian = qiongtongbaojian;
    _ditiansui = ditiansui;
    _sanmingtonghui1 = sanmingtonghui1;
    _sanmingtonghui2 = sanmingtonghui2;
    _sanmingtonghui3 = sanmingtonghui3;
    _sanmingtonghui4 = sanmingtonghui4;
    _bazitiyao1 = bazitiyao1;
    _bazitiyao2 = bazitiyao2;
    _bazitiyao3 = bazitiyao3;
    _shenfengtongkao1 = shenfengtongkao1;
    _shenfengtongkao2 = shenfengtongkao2;
    _shenfengtongkao3 = shenfengtongkao3;
    _tianwuwuxian = tianwuwuxian;
    _wuxingjingji1 = wuxingjingji1;
    _wuxingjingji2 = wuxingjingji2;
    _wuxingjingji3 = wuxingjingji3;
    _wuxingjingji4 = wuxingjingji4;
    _wuxingjingji5 = wuxingjingji5;
    _wuxingjingji6 = wuxingjingji6;
    _lixuzhongmingshu1 = lixuzhongmingshu1;
    _lixuzhongmingshu2 = lixuzhongmingshu2;
    _xiyongshencankao1 = xiyongshencankao1;
    _xiyongshencankao2 = xiyongshencankao2;
    _rizhufenxi = rizhufenxi;
    _xingZuo = xingZuo;
    _yrjpfx = yrjpfx;
    _gdlm = gdlm;
    _scwg = scwg;
    _liangtoqian = liangtoqian;
    _gewuzhiyan = gewuzhiyan;
}

  Fx.fromJson(dynamic json) {
    _zncs = json['zncs'] != null ? json['zncs'].cast<String>() : [];
    _kwsc2 = json['KWSC2'] != null ? json['KWSC2'].cast<String>() : [];
    _gz = json['gz'];
    _cgg = json['cgg'];
    _cggj = json['cggj'];
    _cgjs = json['cgjs'];
    _qiongtongbaojian = json['qiongtongbaojian'];
    _ditiansui = json['ditiansui'];
    _sanmingtonghui1 = json['sanmingtonghui1'];
    _sanmingtonghui2 = json['sanmingtonghui2'];
    _sanmingtonghui3 = json['sanmingtonghui3'];
    _sanmingtonghui4 = json['sanmingtonghui4'];
    _bazitiyao1 = json['bazitiyao1'];
    _bazitiyao2 = json['bazitiyao2'];
    _bazitiyao3 = json['bazitiyao3'];
    _shenfengtongkao1 = json['shenfengtongkao1'];
    _shenfengtongkao2 = json['shenfengtongkao2'];
    _shenfengtongkao3 = json['shenfengtongkao3'];
    _tianwuwuxian = json['tianwuwuxian'];
    _wuxingjingji1 = json['wuxingjingji1'];
    _wuxingjingji2 = json['wuxingjingji2'];
    _wuxingjingji3 = json['wuxingjingji3'];
    _wuxingjingji4 = json['wuxingjingji4'];
    _wuxingjingji5 = json['wuxingjingji5'];
    _wuxingjingji6 = json['wuxingjingji6'];
    _lixuzhongmingshu1 = json['lixuzhongmingshu1'];
    _lixuzhongmingshu2 = json['lixuzhongmingshu2'];
    _xiyongshencankao1 = json['xiyongshencankao1'];
    _xiyongshencankao2 = json['xiyongshencankao2'];
    _rizhufenxi = json['rizhufenxi'] != null ? json['rizhufenxi'] : null;
    _xingZuo = json['XingZuo'] != null ? json['XingZuo'] : null;
    _yrjpfx = json['YRJPFX'];
    _gdlm = json['GDLM'] != null ? json['GDLM'].cast<String>() : [];
    _scwg = json['SCWG'] != null ? json['SCWG'].cast<String>() : [];
    _liangtoqian = json['liangtoqian'];
    _gewuzhiyan = json['gewuzhiyan'];
  }
  List<String>? _zncs;
  List<String>? _kwsc2;
  String? _gz;
  String? _cgg;
  String? _cggj;
  String? _cgjs;
  String? _qiongtongbaojian;
  String? _ditiansui;
  String? _sanmingtonghui1;
  String? _sanmingtonghui2;
  String? _sanmingtonghui3;
  String? _sanmingtonghui4;
  String? _bazitiyao1;
  String? _bazitiyao2;
  String? _bazitiyao3;
  String? _shenfengtongkao1;
  String? _shenfengtongkao2;
  String? _shenfengtongkao3;
  String? _tianwuwuxian;
  String? _wuxingjingji1;
  String? _wuxingjingji2;
  String? _wuxingjingji3;
  String? _wuxingjingji4;
  String? _wuxingjingji5;
  String? _wuxingjingji6;
  String? _lixuzhongmingshu1;
  String? _lixuzhongmingshu2;
  String? _xiyongshencankao1;
  String? _xiyongshencankao2;
  dynamic? _rizhufenxi;
  dynamic? _xingZuo;
  String? _yrjpfx;
  List<String>? _gdlm;
  List<String>? _scwg;
  String? _liangtoqian;
  String? _gewuzhiyan;
Fx copyWith({  List<String>? zncs,
  List<String>? kwsc2,
  String? gz,
  String? cgg,
  String? cggj,
  String? cgjs,
  String? qiongtongbaojian,
  String? ditiansui,
  String? sanmingtonghui1,
  String? sanmingtonghui2,
  String? sanmingtonghui3,
  String? sanmingtonghui4,
  String? bazitiyao1,
  String? bazitiyao2,
  String? bazitiyao3,
  String? shenfengtongkao1,
  String? shenfengtongkao2,
  String? shenfengtongkao3,
  String? tianwuwuxian,
  String? wuxingjingji1,
  String? wuxingjingji2,
  String? wuxingjingji3,
  String? wuxingjingji4,
  String? wuxingjingji5,
  String? wuxingjingji6,
  String? lixuzhongmingshu1,
  String? lixuzhongmingshu2,
  String? xiyongshencankao1,
  String? xiyongshencankao2,
  dynamic? rizhufenxi,
  dynamic? xingZuo,
  String? yrjpfx,
  List<String>? gdlm,
  List<String>? scwg,
  String? liangtoqian,
  String? gewuzhiyan,
}) => Fx(  zncs: zncs ?? _zncs,
  kwsc2: kwsc2 ?? _kwsc2,
  gz: gz ?? _gz,
  cgg: cgg ?? _cgg,
  cggj: cggj ?? _cggj,
  cgjs: cgjs ?? _cgjs,
  qiongtongbaojian: qiongtongbaojian ?? _qiongtongbaojian,
  ditiansui: ditiansui ?? _ditiansui,
  sanmingtonghui1: sanmingtonghui1 ?? _sanmingtonghui1,
  sanmingtonghui2: sanmingtonghui2 ?? _sanmingtonghui2,
  sanmingtonghui3: sanmingtonghui3 ?? _sanmingtonghui3,
  sanmingtonghui4: sanmingtonghui4 ?? _sanmingtonghui4,
  bazitiyao1: bazitiyao1 ?? _bazitiyao1,
  bazitiyao2: bazitiyao2 ?? _bazitiyao2,
  bazitiyao3: bazitiyao3 ?? _bazitiyao3,
  shenfengtongkao1: shenfengtongkao1 ?? _shenfengtongkao1,
  shenfengtongkao2: shenfengtongkao2 ?? _shenfengtongkao2,
  shenfengtongkao3: shenfengtongkao3 ?? _shenfengtongkao3,
  tianwuwuxian: tianwuwuxian ?? _tianwuwuxian,
  wuxingjingji1: wuxingjingji1 ?? _wuxingjingji1,
  wuxingjingji2: wuxingjingji2 ?? _wuxingjingji2,
  wuxingjingji3: wuxingjingji3 ?? _wuxingjingji3,
  wuxingjingji4: wuxingjingji4 ?? _wuxingjingji4,
  wuxingjingji5: wuxingjingji5 ?? _wuxingjingji5,
  wuxingjingji6: wuxingjingji6 ?? _wuxingjingji6,
  lixuzhongmingshu1: lixuzhongmingshu1 ?? _lixuzhongmingshu1,
  lixuzhongmingshu2: lixuzhongmingshu2 ?? _lixuzhongmingshu2,
  xiyongshencankao1: xiyongshencankao1 ?? _xiyongshencankao1,
  xiyongshencankao2: xiyongshencankao2 ?? _xiyongshencankao2,
  rizhufenxi: rizhufenxi ?? _rizhufenxi,
  xingZuo: xingZuo ?? _xingZuo,
  yrjpfx: yrjpfx ?? _yrjpfx,
  gdlm: gdlm ?? _gdlm,
  scwg: scwg ?? _scwg,
  liangtoqian: liangtoqian ?? _liangtoqian,
  gewuzhiyan: gewuzhiyan ?? _gewuzhiyan,
);
  List<String>? get zncs => _zncs;
  List<String>? get kwsc2 => _kwsc2;
  String? get gz => _gz;
  String? get cgg => _cgg;
  String? get cggj => _cggj;
  String? get cgjs => _cgjs;
  String? get qiongtongbaojian => _qiongtongbaojian;
  String? get ditiansui => _ditiansui;
  String? get sanmingtonghui1 => _sanmingtonghui1;
  String? get sanmingtonghui2 => _sanmingtonghui2;
  String? get sanmingtonghui3 => _sanmingtonghui3;
  String? get sanmingtonghui4 => _sanmingtonghui4;
  String? get bazitiyao1 => _bazitiyao1;
  String? get bazitiyao2 => _bazitiyao2;
  String? get bazitiyao3 => _bazitiyao3;
  String? get shenfengtongkao1 => _shenfengtongkao1;
  String? get shenfengtongkao2 => _shenfengtongkao2;
  String? get shenfengtongkao3 => _shenfengtongkao3;
  String? get tianwuwuxian => _tianwuwuxian;
  String? get wuxingjingji1 => _wuxingjingji1;
  String? get wuxingjingji2 => _wuxingjingji2;
  String? get wuxingjingji3 => _wuxingjingji3;
  String? get wuxingjingji4 => _wuxingjingji4;
  String? get wuxingjingji5 => _wuxingjingji5;
  String? get wuxingjingji6 => _wuxingjingji6;
  String? get lixuzhongmingshu1 => _lixuzhongmingshu1;
  String? get lixuzhongmingshu2 => _lixuzhongmingshu2;
  String? get xiyongshencankao1 => _xiyongshencankao1;
  String? get xiyongshencankao2 => _xiyongshencankao2;
  dynamic? get rizhufenxi => _rizhufenxi;
  dynamic? get xingZuo => _xingZuo;
  String? get yrjpfx => _yrjpfx;
  List<String>? get gdlm => _gdlm;
  List<String>? get scwg => _scwg;
  String? get liangtoqian => _liangtoqian;
  String? get gewuzhiyan => _gewuzhiyan;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['zncs'] = _zncs;
    map['KWSC2'] = _kwsc2;
    map['gz'] = _gz;
    map['cgg'] = _cgg;
    map['cggj'] = _cggj;
    map['cgjs'] = _cgjs;
    map['qiongtongbaojian'] = _qiongtongbaojian;
    map['ditiansui'] = _ditiansui;
    map['sanmingtonghui1'] = _sanmingtonghui1;
    map['sanmingtonghui2'] = _sanmingtonghui2;
    map['sanmingtonghui3'] = _sanmingtonghui3;
    map['sanmingtonghui4'] = _sanmingtonghui4;
    map['bazitiyao1'] = _bazitiyao1;
    map['bazitiyao2'] = _bazitiyao2;
    map['bazitiyao3'] = _bazitiyao3;
    map['shenfengtongkao1'] = _shenfengtongkao1;
    map['shenfengtongkao2'] = _shenfengtongkao2;
    map['shenfengtongkao3'] = _shenfengtongkao3;
    map['tianwuwuxian'] = _tianwuwuxian;
    map['wuxingjingji1'] = _wuxingjingji1;
    map['wuxingjingji2'] = _wuxingjingji2;
    map['wuxingjingji3'] = _wuxingjingji3;
    map['wuxingjingji4'] = _wuxingjingji4;
    map['wuxingjingji5'] = _wuxingjingji5;
    map['wuxingjingji6'] = _wuxingjingji6;
    map['lixuzhongmingshu1'] = _lixuzhongmingshu1;
    map['lixuzhongmingshu2'] = _lixuzhongmingshu2;
    map['xiyongshencankao1'] = _xiyongshencankao1;
    map['xiyongshencankao2'] = _xiyongshencankao2;
    if (_rizhufenxi != null) {
      map['rizhufenxi'] = _rizhufenxi?.toJson();
    }
    if (_xingZuo != null) {
      map['XingZuo'] = _xingZuo?.toJson();
    }
    map['YRJPFX'] = _yrjpfx;
    map['GDLM'] = _gdlm;
    map['SCWG'] = _scwg;
    map['liangtoqian'] = _liangtoqian;
    map['gewuzhiyan'] = _gewuzhiyan;
    return map;
  }

}

/// yhbh : null
/// beizhu : ""
/// name : "第七位"
/// xmwx : "第(木)七(金)位(土)"
/// sexx : "男"
/// PPFS : "公历排盘"
/// city : "北京 北京 东城区"
/// ztys : "0"
/// Z_QRQ : "2024年3月20日00时0分"
/// JYRQ : "2029-06-09"
/// GNF : "2024"
/// SiLing : "乙"
/// SiLingFangshi : "子平真诠"
/// nylm : "伏潭之龙"
/// KLFX : "XmY1BCsMgEEVPM7PpxqSajotZaDQXyAmkBJEWU5Iu0ttXpaVQmMX7n8efcH3yesMcGPwFzFjPS7AEdG7ggJwLrFIuhgJSzSjggYZe9LIGq8HK4gOOgRyDqRcOyp07iy3bAHNuGLaFrGw7MhK0oatpda19ZM5QtuH9eANr920o3cdaIH7crCYFOO7mxALvSzpSjjHymjE8Endv"
/// XingZuo : "双鱼座"
/// WuHou : "玄鸟至"
/// Hou : "春分 初候"
/// getXiu : "壁"
/// getAnimal : "獝"
/// getXiuLuck : "吉"
/// getXiuSong : "壁星造作主增财，丝蚕大熟福滔天，奴婢自来人口进，开门放水出英贤，埋葬招财官品进，家中诸事乐陶然，婚姻吉利主贵子，早播名誉著祖鞭。"
/// getZheng : "水"
/// getYueXiang : "宵"
/// SCWG : "天格:木(2) 人格:火(3) 地格:水(9) 总格:水(10) 外格:金(7)"
/// shengxiao : "龙"

System systemFromJson(String str) => System.fromJson(json.decode(str));
String systemToJson(System data) => json.encode(data.toJson());
class System {
  System({
      dynamic yhbh, 
      String? beizhu, 
      String? name, 
      String? xmwx, 
      String? sexx, 
      String? ppfs, 
      String? city, 
      String? ztys, 
      String? zqrq, 
      String? jyrq, 
      String? gnf, 
      String? siLing, 
      String? siLingFangshi, 
      String? nylm, 
      String? klfx, 
      String? xingZuo, 
      String? wuHou, 
      String? hou, 
      String? getXiu, 
      String? getAnimal, 
      String? getXiuLuck, 
      String? getXiuSong, 
      String? getZheng, 
      String? getYueXiang, 
      String? scwg, 
      String? shengxiao,}){
    _yhbh = yhbh;
    _beizhu = beizhu;
    _name = name;
    _xmwx = xmwx;
    _sexx = sexx;
    _ppfs = ppfs;
    _city = city;
    _ztys = ztys;
    _zqrq = zqrq;
    _jyrq = jyrq;
    _gnf = gnf;
    _siLing = siLing;
    _siLingFangshi = siLingFangshi;
    _nylm = nylm;
    _klfx = klfx;
    _xingZuo = xingZuo;
    _wuHou = wuHou;
    _hou = hou;
    _getXiu = getXiu;
    _getAnimal = getAnimal;
    _getXiuLuck = getXiuLuck;
    _getXiuSong = getXiuSong;
    _getZheng = getZheng;
    _getYueXiang = getYueXiang;
    _scwg = scwg;
    _shengxiao = shengxiao;
}

  System.fromJson(dynamic json) {
    _yhbh = json['yhbh'];
    _beizhu = json['beizhu'];
    _name = json['name'];
    _xmwx = json['xmwx'];
    _sexx = json['sexx'];
    _ppfs = json['PPFS'];
    _city = json['city'];
    _ztys = json['ztys'];
    _zqrq = json['Z_QRQ'];
    _jyrq = json['JYRQ'];
    _gnf = json['GNF'];
    _siLing = json['SiLing'];
    _siLingFangshi = json['SiLingFangshi'];
    _nylm = json['nylm'];
    _klfx = json['KLFX'];
    _xingZuo = json['XingZuo'];
    _wuHou = json['WuHou'];
    _hou = json['Hou'];
    _getXiu = json['getXiu'];
    _getAnimal = json['getAnimal'];
    _getXiuLuck = json['getXiuLuck'];
    _getXiuSong = json['getXiuSong'];
    _getZheng = json['getZheng'];
    _getYueXiang = json['getYueXiang'];
    _scwg = json['SCWG'];
    _shengxiao = json['shengxiao'];
  }
  dynamic _yhbh;
  String? _beizhu;
  String? _name;
  String? _xmwx;
  String? _sexx;
  String? _ppfs;
  String? _city;
  String? _ztys;
  String? _zqrq;
  String? _jyrq;
  String? _gnf;
  String? _siLing;
  String? _siLingFangshi;
  String? _nylm;
  String? _klfx;
  String? _xingZuo;
  String? _wuHou;
  String? _hou;
  String? _getXiu;
  String? _getAnimal;
  String? _getXiuLuck;
  String? _getXiuSong;
  String? _getZheng;
  String? _getYueXiang;
  String? _scwg;
  String? _shengxiao;
System copyWith({  dynamic yhbh,
  String? beizhu,
  String? name,
  String? xmwx,
  String? sexx,
  String? ppfs,
  String? city,
  String? ztys,
  String? zqrq,
  String? jyrq,
  String? gnf,
  String? siLing,
  String? siLingFangshi,
  String? nylm,
  String? klfx,
  String? xingZuo,
  String? wuHou,
  String? hou,
  String? getXiu,
  String? getAnimal,
  String? getXiuLuck,
  String? getXiuSong,
  String? getZheng,
  String? getYueXiang,
  String? scwg,
  String? shengxiao,
}) => System(  yhbh: yhbh ?? _yhbh,
  beizhu: beizhu ?? _beizhu,
  name: name ?? _name,
  xmwx: xmwx ?? _xmwx,
  sexx: sexx ?? _sexx,
  ppfs: ppfs ?? _ppfs,
  city: city ?? _city,
  ztys: ztys ?? _ztys,
  zqrq: zqrq ?? _zqrq,
  jyrq: jyrq ?? _jyrq,
  gnf: gnf ?? _gnf,
  siLing: siLing ?? _siLing,
  siLingFangshi: siLingFangshi ?? _siLingFangshi,
  nylm: nylm ?? _nylm,
  klfx: klfx ?? _klfx,
  xingZuo: xingZuo ?? _xingZuo,
  wuHou: wuHou ?? _wuHou,
  hou: hou ?? _hou,
  getXiu: getXiu ?? _getXiu,
  getAnimal: getAnimal ?? _getAnimal,
  getXiuLuck: getXiuLuck ?? _getXiuLuck,
  getXiuSong: getXiuSong ?? _getXiuSong,
  getZheng: getZheng ?? _getZheng,
  getYueXiang: getYueXiang ?? _getYueXiang,
  scwg: scwg ?? _scwg,
  shengxiao: shengxiao ?? _shengxiao,
);
  dynamic get yhbh => _yhbh;
  String? get beizhu => _beizhu;
  String? get name => _name;
  String? get xmwx => _xmwx;
  String? get sexx => _sexx;
  String? get ppfs => _ppfs;
  String? get city => _city;
  String? get ztys => _ztys;
  String? get zqrq => _zqrq;
  String? get jyrq => _jyrq;
  String? get gnf => _gnf;
  String? get siLing => _siLing;
  String? get siLingFangshi => _siLingFangshi;
  String? get nylm => _nylm;
  String? get klfx => _klfx;
  String? get xingZuo => _xingZuo;
  String? get wuHou => _wuHou;
  String? get hou => _hou;
  String? get getXiu => _getXiu;
  String? get getAnimal => _getAnimal;
  String? get getXiuLuck => _getXiuLuck;
  String? get getXiuSong => _getXiuSong;
  String? get getZheng => _getZheng;
  String? get getYueXiang => _getYueXiang;
  String? get scwg => _scwg;
  String? get shengxiao => _shengxiao;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['yhbh'] = _yhbh;
    map['beizhu'] = _beizhu;
    map['name'] = _name;
    map['xmwx'] = _xmwx;
    map['sexx'] = _sexx;
    map['PPFS'] = _ppfs;
    map['city'] = _city;
    map['ztys'] = _ztys;
    map['Z_QRQ'] = _zqrq;
    map['JYRQ'] = _jyrq;
    map['GNF'] = _gnf;
    map['SiLing'] = _siLing;
    map['SiLingFangshi'] = _siLingFangshi;
    map['nylm'] = _nylm;
    map['KLFX'] = _klfx;
    map['XingZuo'] = _xingZuo;
    map['WuHou'] = _wuHou;
    map['Hou'] = _hou;
    map['getXiu'] = _getXiu;
    map['getAnimal'] = _getAnimal;
    map['getXiuLuck'] = _getXiuLuck;
    map['getXiuSong'] = _getXiuSong;
    map['getZheng'] = _getZheng;
    map['getYueXiang'] = _getYueXiang;
    map['SCWG'] = _scwg;
    map['shengxiao'] = _shengxiao;
    return map;
  }

}